d ={"401": {
     "text": '''ПРОВЕРЬТЕ СВОЮ УДАЧУ.Если вы удачливы, то 546, если нет - 77.''',
     "goto": [546, 77]},
    
    "402": {
     "text": '''Вы берете копье, но оно выскальзывает из рук, царапая вас наконечником, после чего
растворяется в воздухе.Потеряйте 1 СИЛУ.Пронизывающее воздух напряжение не позволяет задерживаться:все
в вас стремится прочь от этого места.Осталось только решить, через какую дверь уходить:правую (547) или левую (501)? ''',
     "goto": [547, 501]},
    "403": {
     "text": ''' Не успевает пройти и четверть часа, как снова развилка. Но на этот раз на ней есть указатель.
Сначала вы даже не верите своим глазам, настроившись на битвы и не рассчитывая на гостеприимство. Однако деревянная стрелка, прибитая к дереву, указывает прямо: "Таверна".
Вы пойдете туда (199) или свернете налево (606)?''',
     "goto": [199,606]},
    "404": {
     "text": ''' На дороге появляются два скачущих во весь опор рыцаря. Оба закованы в тяжелызеленые латы, на щитах - силуэт Черного замка.
Вы понимаете свою ошибку - это враги, спрятаться уже некуда. Изображение замка на щите начинает расти, и вскоре вы видитетолько его, и ничего больше.
Мрачный, угрюмый замок, по бокам невысокие сторожевые башенки, под одной из них исчезает голубая змейка.Неужели река? Но тогда замок должен быть огромен.
Резкая боль заставляет прийти в себя.Один из рыцарей уже миновал вас,на полном скаку ударив копьем (потеряйте 3 СИЛЫ).
И теперь, отбросив копье, он разворачивает лошадь и достает меч. Щит приворожил вас, отвлек внимание в самый нужный момент - дело явно не обошлось без колдовства.
Теперь надо мгновенно решать, что делать: выхватить меч и драться (183) или попробовать наложить какое-нибудь заклятие: Ловкости (36), Слабости (314), Копии (7), Огня (112). ''',
     "goto": [183,36,314,7,112]},
    "405": {     "text": ''' Неожиданно вы чувствуете, что ваш Оберег ведет себя как-то неспокойно, как будто хочет вырваться наружу.
Повинуясь не осознанному до конца импульсу, вы вынимаете его из-под одежды и показываете рыцарю. К вашему великому удивлению,
он низко кланяется и отступает в сторону, чтобы пропустить вас. Вы же идете дальше по коридору, пока он не заканчивается невысокой дверью - 241. ''',
     "goto": [241]},
    "406": {
     "text": ''' Вы надеетесь, что тропинкой пользуются охотники, снабжающие замок дичью. Тогда она должна привести вас прямо к воротам.
Однако проходит несколько часов, а лес даже не редеет, безмолвные деревья все так же стоят часовыми по краям тропинки, и начинает казаться,
что чаща бесконечна, а могущественные чары заставят вас всю жизнь петлять по ней, так и не увидев ни выхода, ни Черного замка.
Внезапно тропинка сворачивает к небольшой поляне справа от вас. Скорее всего это пасека: видны ульи и слышится слабое жужжание пчел.
Однако есть и путь вперед: неширокая, ухоженная дорожка, идущая в лес прямо перед вами. Что вы выберете? 
Пойдете прямо - 98? 
Или приблизитесь к ульям - 515? ''',
     "goto": [98,515]},
    "407": {
     "text": '''Вскоре тропинка выходит на широкую дорогу. Может быть, это та самая, которая шла от перекрестка прямо?Не исключено, но возвращаться назад ни к чему,
и вы решаете, что такая дорога наверняка должна вести к какому-нибудь жилью, а если повезет, и к самому Черному замку - 181. ''',
     "goto": [181]},
    "408": {
     "text": ''' Мертвая Обезьяна лежит у ваших ног. Передохнув полчасика (не зря же сражались за тенек), можете восстановить 1 СИЛУ.
После этого вы внимательно осматриваете логово Обезьяны: кто знает, какие полезные вещи могут там оказаться, ведь наверняка вы не первый путник,
на которого она напала. Да и полуобглоданный скелет какого-то странного полуживотного-получеловека, лежащего под деревом с другой стороны, говорит о том же самом.
Ваши поиски не безуспешны: вы находите совершенно незнакомый вам орден в виде летящего сокола (+ 45) и маленькую фляжку.
Орден, разумеется, можете положить в заплечный мешок, но что делать с фляжкой? Вы осторожно открываете пробку - она полна какой-то бесцветной жидкостью,
запах которой ничего вам не напоминает. Выпьете содержимое (131), возьмете фляжку с собой (- 187)
или не будете рисковать и уйдете по тропинке,ведущей от дерева в лес (305)? А может быть, вернетесь на дорогу (210)? ''',
     "goto": [131,305,210]},
    "409": {
     "text": '''Вы приходите в себя и видите, что лежите на полу в просторной клетке, стоящей у стены в большой комнате с толстыми каменными стенами.
По сырости на них вы сразу понимаете, что это должен быть один из подземных этажей замка, но какой? Впрочем, сейчас надо думать о том, как выбраться отсюда.
Вы неторопливо осматриваетесь, благо времени более чем достаточно. Из мебели в комнате только стол, два покосившихся стула да небольшой ларь, стоящий у стены.
За столом - два Гоблина. Они увлечены игрой в кости и не обращают на вас никакого внимания. Неудивительно: даже если бы они и знали, что вы пришли в себя,
шансов выбраться из клетки у вас все равно нет. Комнату освещает единственная свеча, горящая на столе, и в ее мерцающем свете вы видите,
что рядом со столом на полу валяются ваши вещи: игра идет именно на них. Вам же остается надеяться только на свою магию.
Попробуете использовать заклятие Иллюзии (280), Огня (114), или у вас нет ни того, ни другого (56)? ''',
     "goto": [280,114,56]},
    "410": {
     "text": '''Вы накладываете заклятие, и в воздухе появляется раскаленный огненный шар, устремляющийся к пауку.
Он изо всех сил старается увернуться, но увы: на земле ваш противник далеко не столь проворен, и вскоре от него остается только горстка темно-серого пепла - 189. 
''',
     "goto": [189]},
    "411": {
     "text": '''Мясо вполне сносно и может восстановить 6 СИЛ.
Хотите попробовать еще и овощи (если вы еще этого не делали) - 578 или покинете комнату через дверь в правой стене (80)?''',
     "goto": []},
    "412": {
     "text": '''Внезапно небо над головой темнеет, и вы видите, как на поляну опускается огромный двухголовый Дракон.
Теперь понятно, почему деревья по краям обуглены, но уже слишком поздно. Однако Дракон не торопится нападать.
Он опускается на землю и внимательно смотрит в вашу сторону, словно чего-то ждет. Вы можете либо сразу ринуться в бой, решив обойтись без магии (316),
либо использовать заклятия - Огня (37), Ловкости (357) или Слабости (256). А может быть, лучше предложить миролюбивому Дракону подарок (516)?''',
     "goto": [316,37,357,256,516]},
    "413": {
     "text": '''Заклятие переносит вас на маленький остров, и вы оглядываетесь по сторонам - 132. ''',
     "goto": [132]},
    "414": {
     "text": '''Ваши противники повержены. Вы можете взять латы одного из них и понести с собой (они займут три места в вашем заплечном мешке).
Но проникнуть в замок они не помогут: ехать на лошади слишком опасно, а пеший рыцарь неизбежно вызовет подозрение. Однако если вам суждено будет попасть в замок,
прибавьте 60 к номеру первого же параграфа. Пока латы на вас, ваша одежда будет занимать только одно место в заплечном мешке. Но будьте осторожны: ведь вы не знаете,
как должен вести себя Зеленый рыцарь в замке, куда ему можно, а куда нельзя ходить. Не злоупотребляйте переодеванием - можете попасть в беду.
В карманах у рыцарей вы находите всего лишь перо павлина (+ 206) - можете взять его с собой. Но ведь главное богатство рыцаря не деньги, а меч (- 177).
Можете взять клинок любого из противников, он прибавит 1 ЛОВКОСТЬ (в том числе и сверх изначальной), но тогда ваш собственный меч придется оставить на поле боя.
Решив не рисковать встретить на этой дороге других рыцарей, вы возвращаетесь к развилке и идете направо - 338. ''',
     "goto": [338]},    
    "415": {
     "text": '''ПРОВЕРЬТЕ СВОЮ УДАЧУ. Если Судьба благосклонна к вам, то 430, если нет - 579.''',
     "goto": [430,579]},
    "416": {
     "text": '''Вы приближаетесь к большому зданию в центре двора. Теперь ясно, что именно это и есть цитадель волшебника - цель вашего путешествия.
Высокое и мрачное, оно возвышается над вами. Его венчает неприступная башня - быть может, Принцессу заточили там? Или наверху покои самого Барлада Дэрта?
Так или иначе надо искать вход. Вы обходите замок и находите то, что ищете: большие массивные двери, к которым подвешен дверной молоток в форме боевого топора.
Поблизости никого нет, но теперь вам виден дальний конец двора. Там горят костры и факелы, разбиты палатки, между которыми снуют Гоблины и Орки. Военный лагерь врага!
Быть может, стоит пойти туда и попытаться разузнать что-нибудь о замке (424)? Или лучше не терять времени и попробовать войти (257)? 
''',
     "goto": [424,257]},
    "417": {
     "text": '''Вы накладываете заклятие Ловкости и чувствуете, что ваша Ловкость увеличивается. На время боя прибавьте 2 к своей Ловкости и сражайтесь с Водяным - 326.''',
     "goto": [326]},
    "418": {
     "text": ''' Конечно, хотелось бы поговорить со стариком подольше, но он начинает заметно нервничать, подозревая в вас одного из шпионов Черного мага.
Отчаявшись что-либо узнать, вы покидаете деревню - 179. 

''',
     "goto": [179]},
    "419": {
     "text": '''Вложив меч в ножны, показываете им пустые руки, желая убедить в том, что не замышляете ничего плохого.
Однако незнакомцам не так-то просто поверить вам. Неожиданно они спрашивают, нет ли у вас с собой еды. Дадите им поесть (104) или откажете (634)? ''',
     "goto": [104,634]},
    "420": {
     "text": '''
      Вы протягиваете Оберег, но хозяйка гарема не знает, для чего он может ей пригодиться. Однако понимая, что вы хотели сделать подарок,
      но незнакомы с местными обычаями, она уносит его в свою комнату, а вы можете вернуться на 255 и подумать, что делать дальше.''',
     "goto": [255]},
    "421": {
     "text": '''По выбранной тропинке идете около получаса. Неожиданно она внезапно обрывается. Просто кончается, как будто те, кто ее проложил, ходили только до этого места.
Как это может быть? Поищете разгадку (330) или вернетесь на развилку и изберете иной путь (73)? ''',
     "goto": [330,73]},
    "422": {
     "text": '''Коридор упирается в ряд решеток. Перед ними узкий проход. Вы подходите к камере справа, подносите свет и пытаетесь разглядеть,
кто или что скрывается там. В углу каменной клетки сидит, скорчившись от холода, седой старик. Вы подзываете его, но он не сразу откликается на ваш голос,
не в силах поверить, что его зовет человек! Когда же он отзывается, слова его очень странны: "Приветствую тебя, смельчак! Не находил ли ты в дороге серебряное кольцо?"
. Вы удивлены: вопрос не о свободе, не о том, что творится за стенами подземелья, а о каком-то кольце! Неужели эта вещица для узника важнее всего? Но надо отвечать.
Если у вас есть кольцо и вы хотите в этом признаться, можете это сделать. Иначе придется сказать, что такого кольца у вас нет - 133.''',
     "goto": [133]},
    "423": {
     "text": '''Тропинка петляет вдоль реки, то отдаляясь, то приближаясь к воде. По краям растет высокий густой кустарник,
и поначалу вы продвигаетесь вперед крайне осторожно. Один поворот, второй, третий, опасности нет, и вы начинаете идти быстрее.
Вскоре тропинка вновь спускается на берег реки, но что это? Вы вышли к мосту, а около него - охрана. Два Гоблина поставлены здесь для того,
чтобы никто посторонний не мог перебраться через реку. Ваша одежда ясно показывает им, что вы не служите волшебнику.
Скорее решайте, что делать, ведь они вот-вот атакуют вас. Если воспользуетесь заклятием Ловкости, можете на время боя увеличить на 2 свою Ловкость.
Предпочтете заклятие Слабости, вычитайте 2 из МОЩНОСТИ УДАРА любого из Гоблинов. Коли выбрали эти магические приемы или решили просто сражаться мечом - 40.
Если же есть желание обратиться к заклятию Огня, то 290. ''',
     "goto": [40,290]},
     "424": {
     "text": '''Вы неторопливо подходите к палаткам поближе. Гоблины и Орки не обращают на вас никакого внимания, к тому же вы замечаете, что они безоружны.
Вскоре становится понятно, что это новобранцы, но между палатками прохаживаются и два вооруженных до зубов командира - вам лучше не попадаться им на глаза,
ведь они-то сразу поймут, в чем дело.Вы можете подсесть к одному из костров и поговорить с Орками (582) или же решить,
что лучше уж попытаться проникнуть в центральное строение (74). ''',
     "goto": [582,74]},
    "425": {
     "text": '''Вам удается долететь только до середины озера, когда заклятие перестает действовать. Майлин же предупреждал вас: не переоцените свои силы.
Теперь скорее накладывайте еще одно заклятие - Левитации или Плавания (614) - иначе судьба ваша плачевна (581).''',
     "goto": [614,581]},
    "426": {
     "text": '''В ответ разбойники только смеются. "Мы и так возьмем все твое золото!Наверняка в твоем мешке есть что-то более ценное,
раз ты так легко готов расстаться с ним!"Вы понимаете, что пощады ждать не приходится и решаете драться - 123.''',
     "goto": [123]},
    "427": {
     "text": '''Дверь заперта. Если у вас есть золотой свисток, можете попытаться им воспользоваться. Иначе или попробуйте выломать дверь (597),
или уходите через любую другую: правую (398), левую (206) или среднюю (350).''',
     "goto": [597,398,206,350]},
    "428": {
     "text": '''Если воспользуетесь заклятием Ловкости, можете на время боя увеличить на 2 свою Ловкость. Предпочтете заклятие Слабости,вычитайте 2 из МОЩНОСТИ УДАРА любого из стражников.
Коли выбрали эти магические приемы или решили просто сражаться мечом, - 647.Если же есть желание обратиться к заклятию Огня, то 499.''',
     "goto": [647,499]},
     "429": {
     "text": '''Вы достаете Золотое ожерелье, и оно начинает мягко мерцать в темноте. "Это то, что мы искали все эти годы", - слышится все тот же голос.
Невидимая рука бережно принимает у вас драгоценность, и она исчезает. Через несколько секунд голос продолжает: "Ты свободен, щедрый рыцарь". Рука освещает вам выход.
Дверь оказывается совсем не там, где вы думали, и вы с облегчением открываете ее - 301.''',
     "goto": [301]},
    "430": {
     "text": '''Все обходится благополучно, если не считать того, что дорога вскоре кончается и вперед ведет узкая тропинка, почти незаметная среди травы.
Но обратно вернуться уже нельзя (не тратить же заклятие Левитации, если даже оно у вас есть), и вы идете до самого конца - 181. ''',
     "goto": [181]},
    "431": {
     "text": ''' Оборотень говорит вам, что, если идти все время прямо, можно достичь ворот Черного замка, и скрывается в лесу.
Вы продолжаете свой путь по дороге, как вдруг огромное дерево со зловещим треском наклоняется и... ПРОВЕРЬТЕ СВОЮ УДАЧУ.
Если вы удачливы, то 59, если нет - 636. ''',
     "goto": [59,636]},
     "432": {
     "text": '''Дорога заводит вас все глубже и глубже в лес. Наступает вечер. Положившись на удачу, ночуете под сенью нависающих над дорогой деревьев и продолжаете путь с рассветом.
Вы уже начинаете немного уставать от этих бесконечных развилок, от каждой из которых может зависеть ваша жизнь: ведь выбор приходится делать вслепую.
Вот опять налево отходит тропинка, и вы снова в раздумье: свернуть на нее (421) или продолжать идти прямо (73)? 
''',
     "goto": [421,73]},
    "433": {
     "text": '''Внутри ларя вы находите только большую бутыль, наполненную голубой жидкостью.
Рискнете выпить ее (500), возьмете с собой (+ 103) или предпочтете побыстрее уйти - ведь в любую минуту сюда могут зайти воины чародея (416)?''',
     "goto": []},
    "434": {
     "text": '''В конце лестницы - огромная белая дверь с черным силуэтом замка. Она гораздо уместней смотрелась бы в конце шикарной парадной лестницы, чем той,
по которой вы спустились. Дверь без труда открывается, и вы попадаете в прихожую. Вдоль стен стоят красивые резные диваны.
Вероятно, здесь когда-то было нечто вроде приемной. Но сейчас везде толстый слой пыли, на диванах давно уже никто не сидел. Из приемной ведет пять дверей.
Перед вами едва ли не самый сложный выбор за все путешествие. Три двери гладкие: правая, левая и средняя. Но на двух других есть рисунки.
На второй справа нарисована короткая стрела с белым оперением, и под ней в дереве вырезано какое-то углубление. На второй слева - золотой орел,
под ним тоже виднеетсяуглубление в форме орла. Если у вас есть белая стрела, вы можете попробовать открыть дверь с соответствующим рисунком,
если есть медальон с золотым орлом, сделайте то же самое. Если же нет, то эти двери останутся неприступны, какие бы усилия вы ни прилагали.
Однако у вас все же останется выбор: войти в правую дверь (478), левую (603) или в среднюю (282).''',
     "goto": [478,603,282]},
    "435": {
     "text": '''Подойдя к двери, ведущей на лестницу, вы обнаруживаете, что она не заперта, и спускаетесь вниз - 544.''',
     "goto": [544]},
    "436": {
     "text": ''' Второй рыцарь настолько поражен вашим мастерством, что не имеет ни малейшего желания разделить судьбу своего товарища.
Он подхватывает под уздцы коня с трупом, и они уносятся обратно по дороге. Во время боя из кармана первого рыцаря что-то выпало, вы наклоняетесь и видите,
что в пыли лежит перо павлина (+ 206). Можете взять его с собой. Вряд ли стоит сомневаться, что рыцарь не простит вам смерти своего товарища. А это значит,
что он вот-вот может вернуться с подмогой, так что едва ли разумно идти дальше по этой дороге навстречу своей смерти. Вы решаете вернуться на развилку и пойти направо,
на юго-восток - 338.''',
     "goto": [338]},
    "437": {
     "text": '''Несколько часов проходят без приключений, и вы немного жалеете, что потеряли столько времени, перебираясь через озеро.
Ведь цель вашего путешествия от этого не приблизилась. Вы устали (потеряйте 2 СИЛЫ) и нуждаетесь в отдыхе, но понимаете, что надо торопиться.
Наконец дорога раздваивается. Изберете путь направо (531) или налево (72)?''',
     "goto": [531,72]},
     "438": {
     "text": '''Торговец желает удачной и приятной прогулки, пряча от вас улыбку.
Вы понимаете, что он не поверил вам, но теперь остается только попрощаться и уйти - 106.''',
     "goto": [106]}, 
    "439": {
     "text": '''"В какую же игру вы играете?" - недоверчиво спрашивает Орк. Надо же, об этом-то вы и не подумали.
Решать приходится мгновенно, а на ум приходят только две игры. Скажете, что вы играете в карты (259) или в кости (585)?''',
     "goto": [259,585]},
    "440": {
     "text": '''Коридор делает несколько поворотов и раздваивается. Пойдете направо (348) или налево (61)? ''',
     "goto": [348,61]},
    "441": {
     "text": '''В темноте вы сбиваетесь с дороги.Всю ночь приходится наугад продираться через чащу (потеряйте 3 СИЛЫ).
К утру выходите на какую-то дорогу, но понятия не имеете, куда идти - 378. ''',
     "goto": [378]},
    "442": {
     "text": '''Вы идете всю ночь - за осторожность приходится платить усталостью (потеряйте 2 СИЛЫ). К утру выходите на поляну,
которую во всех направлениях пересекает множество следов каких-то крупных животных - 119.''',
     "goto": []},
    "443": {
     "text": '''
      Торговец предлагает вам присесть у камина и неторопливо рассказывает, куда идут дороги от его дома.
      Справа в лесу Застава - слуги волшебника сторожат дорогу, и никто не может пройти мимо них незамеченным.
      Если же избрать путь, ведущий налево, придете к небольшой хижине, в которой, насколько он знает, живет какой-то странненький старичок.
      Но это не более чем слухи: сам торговец по этой дороге ни разу не ходил и с обитателями хижины не встречался. Напоследок он рассказывает,
      что Черный замок действительно существует, но до него еще очень далеко. Проникнуть туда гораздо труднее, чем пройти через лес,
      и здесь он ничем не может помочь. Единственное, что можно посоветовать: идти в открытую лучше, чем прятаться.
      Когда однажды он пытался войти в замок со своими товарищами (его туда так и не пустили), то видел, как стража извлекала из воза с сеном какого-то человека,
      пытавшегося проникнуть в цитадель незамеченным. Расправа была коротка и жестока. Больше словоохотливый торговец ничего не знает,
      и вам остается только распрощаться и покинуть лавку - 106. ''',
     "goto": [106]},
    "444": {
     "text": '''Перстень с изумрудом очень красив, но как он может помочь разбудить Принцессу? Может быть, он и может когда-нибудь пригодиться,
но, очевидно, не сейчас. Внезапный шум, который с каждой секундой усиливается, заставляет насторожиться - 502. ''',
     "goto": [502]},
    "445": {
     "text": '''Лес светлеет. Кажется, что вы не забираетесь все глубже и глубже в чащу, не приближаетесь к его середине, а направляетесь к мирной,
спокойной опушке, где светит ласковое весеннее солнце и нет никаких опасностей. А вдруг и правда дорожки и тропы запутали вас,
и через несколько мгновений вы покинете лес: ведь это будет означать, что все придется начинать сначала. Но внезапно дорога резко поворачивает,
и деревья расступаются - 102. ''',
     "goto": [102]},
    "446": {
     "text": '''Несколько раз вы дергаете за ручку двери, но безуспешно, и понимаете, что незамеченным пройти не удастся - 328.''',
     "goto": [328]},
    "447": {
     "text": ''' Вы пытаетесь успокоить медведицу, ласково поговорив с ней, но она продолжает надвигаться, не слушая никаких уговоров.
И тут вам совершенно случайно приходит в голову мысль спросить, не надо ли ей чем-нибудь помочь.
Зверь с удивлением останавливается, смотрит умными черными глазами и показывает лапой на медвежонка.
Вы подходите ближе и понимаете, что он болен. Но ведь вы не лекарь. Есть только один способ помочь медведице: истратить заклятие Исцеления.
Если оно у вас есть и вы хотите наложить его на медвежонка, то 62. Если же нет или не хотите, то вы обманули надежды медведицы, и придется драться - 529.''',
     "goto": [62,529]},
    "448": {
     "text": ''' Крестьянин говорит, что и сам может снабдить вас припасами. Для этого надо всего лишь зайти к нему домой. Однако вы не решаетесь заходить в хату,
и он, пожав плечами, выносит во двор все, что может предложить для продажи. Тут вас ожидает сразу два сюрприза. Во-первых, еда совсем не такая,
какую обычно можно встретить в деревне. Перед вами лежит ананас (который стоит 2 золотых и восстановит 3 СИЛЫ), банан (4 золотых - 6 СИЛ), лимон (2 золотых - 2 СИЛЫ).
Но он притащил еще и кучу вещей, которые, как он считает, могут пригодиться в дороге. Это красивый кусочек дерева (- 46)(крестьянин просит за него всего 1 золотой),
фигурный ключ (- 156)(2 золотых), попона для лошади (+ 59)(5 золотых), блестящий кусок металла (- 77)(3 золотых), сделанная из золота устрица (+ 193)(8 золотых)
и серебряный браслет (+ 76)(4 золотых). Сделайте необходимые покупки и покиньте деревню по одной из двух дорог: на юг (235) или на запад (2).''',
     "goto": [235,2]},
    "449": {
     "text": ''' "В какую же игру ты собираешься с ним играть?" - Орк недоверчиво смотрит на вас. Вы не ожидали такого вопроса, и на языке вертятся только две игры.
Скажете, что вы играете в карты (396) или в кости (271)?''',
     "goto": [396,271]},
    "450": {
     "text": ''' После встречи с Лесовичком вы идете не более четверти часа, как дорога выводит вас на перекресток. Вы можете либо свернуть по тропинке налево (292),
пойти прямо (51), или попробовать свернуть направо, если вам кажется, что так вы скорее достигнете цели (586). ''',
     "goto": [292,51,586]}
}
