d = {
    501: {
        "text": """Дверь без труда открывается. За ней - широкая
            лестница с удобными деревянными перилами,
            которая ведет вниз - 434.""",
        "goto": [434]
        },
    502: {
        "text": """За всеми четырьмя дверями слышится топот,
            и в комнату врывается охрана.
            Это десять Зеленых рыцарей во главе с Бароном.
            Предводитель показывает мечом в вашу сторону - и
            начинается бой. Но он слишком неравен,
            чтобы оставить вам хоть какие-нибудь шансы на победу.
            Вам удается убить двух из десяти, и долго еще рыцари будут
            вспоминать о погибшем отважном смельчаке,
            дерзнувшем бросить вызов самому Барладу Дэрту
            и добраться до его главного сокровища - Принцессы...""",
        "goto": [1, ]
        },
    503: {
        "text": """Как выясняется, Гиена не только прекрасно понимает
            человеческую речь, но и не против поболтать с вами.
            Встретив благодарного слушателя, щедро делитесь с ней
            последними сплетнями, услышанными в королевском дворце,
            и рассказываете о пройденном пути. В конце разговора она
            неожиданно просит передать привет разбойникам, если вы их,
            конечно, встретите. Но прежде чем успеваете ее спросить,
            как это сделать, Гиена скрывается в лесу.
            Ваш путь свободен - 117.""",
        "goto": [117]
        },
    504: {
        "text": """Вы бежите из таверны по дороге, ведущей к лесу.
            Однако вскоре понимаете, что Водяной вряд ли станет
            преследовать вас по суше,и переходите на шаг - 332.""",
        "goto": [332]
        },
    505: {
        "text": """Орки мертвы, но несколько минут вы стоите,
            не двигаясь, и прислушиваетесь: не услышал ли кто-нибудь
            шум драки... Все тихо. Теперь можете оглядеться: из комнаты
            ведут три двери, кроме той, в которую вы вошли.
            Пергаменты же написаны на неизвестном языке,
            смысл их остается непонятным. Какую из дверей попытаетесь
            открыть: ту, что перед вами (337),
            ту, что справа от вас (393),
            или ту, что слева (595)?""",
        "goto": [337, 393, 595]
        },
    506: {
        "text": """Вы накладываете заклятие Огня. В воздухе возникает
            огненный шар и испепеляет ближнего к вам Орка.
            Двое остальных не рискуют принять бой: они в ужасе убегают
            в лес, побросав оружие. Черт возьми, не исключено, что,
            вернувшись, они поднимут тревогу. Но не гоняться же за ними
            по всему лесу!
            Понимая, что нужно торопиться, вы входите в ворота - 100.""",
        "goto": [100]
        },
    507: {
        "text": """Вы открываете дверь. За ней - узкая лестница, ведущая
        вниз. Пойдете по ней (598) или заглянете за левую дверь (501)?""",
        "goto": [598, 501]
        },
    508: {
        "text": """Вы используете заклятие и перелетаете через реку.
            Кажется, никто не обратил внимания на столь необычный
            способ преодоления препятствий.
            Теперь можно двигаться дальше - 366.""",
        "goto": [366]
        },
    509: {
        "text": """Дорога выводит на поляну. С вашей стороны почти вся
            трава вытоптана какими-то не слишком маленькими животными.
            К сожалению, вы не следопыт, который смог бы определить,
            кто именно здесь прогуливался. Нетрудно заметить, что с
            другой стороны поляны дорога продолжается. Туда вы и
            направляетесь - 119.""",
        "goto": [119]
        },
    510: {
        "text": """За поворотом дороги становится видно, что путь блокирован
            несколькими поваленными бурей деревьями. Шестое чувство
            подсказывает, что это засада и лучше вернуться назад.
            Не прислушиваться к предчувствиям в полном опасностей лесу - не
            самое разумное. Поколебавшись, возвращаетесь на развилку.
            Но куда теперь: направо (38) или прямо (214)?""",
        "goto": [38, 214]
        },
    511: {
        "text": """Женщины отводят вас на потайную лестницу. Через два
            пролета дверь, но вам не удается ее открыть, и спускаться
            приходится до конца - 544.""",
        "goto": [544]
        },
    512: {
        "text": """Вы толкаете дверь, но она не открывается. Пробуете
            еще раз - безуспешно. В этот момент становится слышно,
            что в соседней комнате звонит колокольчик. Почуяв неладное,
            оборачиваетесь и видите, как Начальник стражи с выпученными
            глазами лихорадочно дергает шнурок звонка. Подбежать к нему
            уже не успеть - одна из дверей распахивается, и комнату
            наводняют вооруженные Орки. По их возбужденным крикам вы
            понимаете, что пытались выйти... во встроенный шкаф.
            Пробуете сопротивляться, но сзади кто-то наносит сильный
            удар по голове (потеряйте 2 СИЛЫ),
            и вы теряете сознание... - 409.""",
        "goto":[409]
        },
    513: {
        "text": """После двух ударов одна из голов Дракона отлетает. Он
            отскакивает назад, а у вас появляется время, чтобы, если
            есть желание, успеть наложить заклятие. Воспользуетесь
            передышкой и используете заклятие Огня (41), Ловкости (476),
            Слабости (172), Копии или будете продолжать драться (347).
            Можете, если хотите, попробовать убежать (601).""",
        "goto":[41, 476, 172, 347, 601]
        },
    514: {
        "text": """Вы покидаете сосновый коридор и устремляетесь по
            новой дороге. Понемногу смеркается, наступает ночь. Хотите
            отдохнуть под одним из деревьев рядом с дорогой (358) или
            пойдете дальше (441)?""",
        "goto":[358, 441]
        },
    515: {
        "text": """Вы подходите к ульям. Это действительно небольшая
            пасека, но никого не видно. Только через несколько минут
            становится понятно, что никого и не надо: пчелы на этой
            волшебной пасеке сами являются зоркими часовыми. Целый рой
            насекомых накидывается на незваного гостя. Вам не удается
            защититься от укусов - не драться же с пчелами мечом.
            Потеряйте 8 СИЛ и, если еще живы, возвращайтесь на дорогу -
            98.""",
        "goto":[98]
        },
    516: {
        "text": """Что вы ему предложите:
          Коготь дракона?
          Бриллиант?
          Гребень?
          Перо аиста?
          Если же ничего из этого у вас нет, придется драться - 316.""",
        "goto":[316]
        },
    517: {
        "text": """Вы уже на середине озера, когда внезапно замечаете
            стаю крупных рыб, плывущую наперерез. Хотите узнать,
            питаются ли они людьми (359), или воспользуетесь
            заклятием Левитации (625)?""",
        "goto":[359, 625]
        },
    518: {
        "text": """Торговец неповоротлив, но удар его очень силен.
            Поэтому всякий раз, когда он ранит вас, вычитайте у себя
            не 2, а 3 СИЛЫ. Решив не тратить заклятия на не столь
            сложного противника, обнажаете меч и вступаете в бой.
            ТОРГОВЕЦ
            Ловкость 6 Сила 12
            Если вы убили его, то 477.""",
        "goto":[477]
        },
    519: {
        "text": """Что вы спросите у них? Как пройти к Принцессе (278),
        где сейчас Барлад Дэрт (43) или где находится Начальник
        стражи (184)?""",
        "goto":[278, 43, 184]
        },
    520: {
        "text": """Они рассказывают вам, что некогда жили в деревушке на
            краю леса. Может быть, вы были в ней? (Если да, то можете
            рассказать им, что стало с деревней). Когда Черный маг
            захватил лес, почти все мужчины были на охоте и ни о чем не
            ведали. По одному многих из них переловили воины волшебника
            и заставили работать на полях неподалеку от замка. Несколько
            недель назад им двоим удалось бежать, и с тех пор
            приходилось питаться тем, что дарил лес. Беглецы просят
            прощения за то, что чуть было не напали на вас и дают
            несколько советов. Самый главный: они случайно узнали из
            разговоров между надсмотрщиками, что, приближаясь к
            волшебнику, лучше идти направо, чем налево. Что это значит,
            они не знают, но надеются, что вы доберетесь до
            ненавистного чародея, и дарят вам зеркальце (- 83),
            небольшую эмблему в виде Черного замка (+ 59) и золотой
            свисток (+ 156), случайно найденные на одном из полей.
            Вероятнее всего, их обронил кто-то из Орков-надсмотрщиков.
            Вдруг пригодится! Кроме того, они говорят, что в замке
            остался их друг, превращенный чародеем в старика, но больше
            о его судьбе ничего неизвестно. Они просят, если вы его
            встретите, передать, что они живы и на свободе. А если вам
            будет нужна помощь, скажите ему: 'Трое из Эвенло'
            (так называлась их деревенька) - и он вам не откажет.
            Если вы решите, что встретили их друга, вычтите 25 из
            номера параграфа, на котором будете находиться, и
            попробуйте, если хотите, передать ему послание Беглецов.
            Теперь же отправляйтесь дальше - 3.""",
        "goto":[495, 3]
        },
    521: {
        "text": """Вы накладываете заклятие и направляете огненный шар
            на Водяного, но он скрывается под водой. Шар следует за
            ним- и... гаснет. Водяной же выныривает обратно и наносит
            ответный удар водорослями (потеряйте 2 СИЛЫ). Теперь вам
            ничего не остается, кроме как сражаться с ним мечом - 326.""",
        "goto":[326]
        },
    522: {
        "text": """Вы обнажаете меч, но она не обращает на него ни
            малейшего внимания. Разозлившись, наносите удар,
            достаточный для того, чтобы разрубить навязчивую старуху
            пополам. Однако клинок проходит сквозь нее, не причинив
            никакого вреда. Обрушив на вашу голову проклятия, нищенка
            тает в воздухе. Путь свободен. Из комнаты две двери.
            Выйдете в ту, которая перед вами (252), или в ту, что
            справа (542)?""",
        "goto":[252, 542]
        },
    523: {
        "text": """Вы поднимаетесь по лестнице, но внезапно одна из
            ступеней подламывается под ногами, и вы летите вниз.
            Потеряйте 4 СИЛЫ: вы упали на каменный пол комнаты и сильно
            ушиблись. Потеряв равновесие, вы обрушили еще несколько
            ступеней, так что по лестнице теперь не пройти. Если у вас
            есть веревка с крюком, можете ей воспользоваться. Если нет,
            вернитесь на параграф с описанием большой залы (39) и
            сделайте более удачный выбор.""",
        "goto":[39]
        },
    524: {
        "text": """Дорога приводит вас на большой перекресток. Впереди
            три дороги. Одна - налево - уходит в том же направлении,
            откуда вы только что пришли. Идти по ней явно не имеет
            смысла. Остаются две: тропинка прямо (89)
            и дорога направо (653).""",
        "goto":[89, 653]
        },
    525: {
        "text": """Вы подходите к дереву и замечаете, что кто-то еще
            хочет воспользоваться тенью. С дерева спускается Обезьяна,
            которая в отличие от вас совершенно не собирается делить
            прохладу с кем бы то ни было. Если у вас есть банан, чтобы
            умилостивить Обезьяну, то 349, если же нет, то вам придется
            драться с ней, и победитель насладится спасительным
            холодком - 215.""",
        "goto":[349, 215]
        },
    526: {
        "text": """Вы спрашиваете у крестьянина, что находится поблизости
            от деревни. Он отвечает крайне неохотно: то ли боится, то ли
            в чем-то вас подозревает. В итоге удается вытянуть из него
            лишь следующее. Если пойдете на юг, то придете к тому, кто
            вас послал; ежели на запад, то там таких как вы шибко не
            любят. Информация странна и непонятна: может быть, он
            принимает вас за кого-то другого? Но так или иначе все же
            нaдо решать, куда идти - на юг (235) или на запад (2).""",
        "goto":[235, 2]
        },
    527: {
        "text": """Для начала вы спрашиваете, не видел ли он кого-нибудь
            из ваших предшественников. Водяной отвечает, что к нему
            заходили лишь двое или трое из них, и всем он с радостью
            помогал. При этих словах в его глазах на мгновение
            появляется какой-то недобрый блеск, но уже через минуту они
            вновь спокойны и приветливы. Вы настораживаетесь,
            вспоминаете, где находитесь, и начинаете внимательнее
            следить за хозяином. Тем временем он предлагает вам еду -
            жареную рыбу (что обойдется вам всего в 1 золотой),
            чистую родниковую воду (2 золотых), но почему-то возражает,
            чтобы вы наполнили свою флягу: предлагает выпить сколько
            угодно, но только не покидая таверны. Что это - странный
            обычай или какой-то подвох? Что вы предпочтете?
            Поблагодарить Водяного и уйти (332), купить у него еду (209)
            Для начала вы спрашиваете, не видел ли он кого-нибудь из
            ваших предшественников. Водяной отвечает, что к нему
            заходили лишь двое или трое из них, и всем он с радостью
            помогал. При этих словах в его глазах на мгновение
            появляется какой-то недобрый блеск, но уже через минуту они
            вновь спокойны и приветливы. Вы настораживаетесь,
            вспоминаете, где находитесь, и начинаете внимательнее
            следить за хозяином. Тем временем он предлагает вам еду -
            жареную рыбу (что обойдется вам всего в 1 золотой),
            чистую родниковую воду (2 золотых), но почему-то возражает,
            чтобы вы наполнили свою флягу: предлагает выпить сколько
            угодно, но только не покидая таверны. Что это - странный
            обычай или какой-то подвох? Что вы предпочтете?
            Поблагодарить Водяного и уйти (332), купить у него еду (209),
            попить воды (376). Или напасть на него (15)?""",
        "goto":[332, 209, 376, 15]
        },
    528: {
        "text": """Вы быстро догоняете волка, который снова становится
            человеком и готовится к бою. В руках у него появляется меч.
            Вы можете воспользоваться только заклятием Копии: все
            остальные Оборотень без труда развеет.
              ОБОРОТЕНЬ
            Ловкость 9 Сила 10
            Если вы убили противника, то можете снять с его шеи
            Оберег (- 131) и надеть на себя. Потом отправляйтесь в путь,
            ведь и так потеряно слишком много времени - 240.""",
        "goto":[240]
        },
    529: {
        "text": """Вы можете воспользоваться заклятием Ловкости,
            увеличив на 2 свою МОЩНОСТЬ УДАРА, или заклятием Слабости,
            уменьшив на столько же МОЩНОСТЬ УДАРА медведицы, а также
            заклятием Копии.
              МЕДВЕДИЦА
            Ловкость 8 Сила 10
            Если вы победили, выбирайтесь из берлоги и идите дальше по
            дороге в глубь леса - 44.""",
        "goto":[44]
        },
    530: {
        "text": """Вскоре ваше внимание привлекает дерево, растущее
            возле дороги. От других оно отличается величиной, и кажется,
            что это не одно, а три или четыре дерева, сросшихся вместе.
            Вы запрокидываете голову и смотрите вверх. В кроне явно
            спрятано чье-то гнездо или логово, оттуда спускается почти
            незаметная веревочная лестница, что-то сильно напоминающая.
            Но что? Хотите взобраться на дерево и посмотреть, кто там
            живет (54), или пойдете дальше (19)?""",
        "goto":[54, 19]
        },
    531: {
        "text": """Тропинка выводит вас на развилку. Пойдете по дороге
            прямо (49) или налево (338)?""",
        "goto":[49, 338]
        },
    532: {
        "text": """Открываете дверь, и она мгновенно захлопывается за
            спиной, совершенно сливаясь со стенами. Вы оказываетесь в
            небольшом холле у входа на второй этаж. Из него ведет
            только одна дверь, и именно у нее стоит охрана - два
            здоровенных Гоблина с зазубренными мечами. Если у вас есть
            пропуск, предъявите его, иначе придется драться. Если вы
            пользуетесь заклятием Ловкости, на время боя увеличьте на 2
            свою Ловкость, если заклятием Слабости, уменьшите на 2
            МОЩНОСТЬ УДАРА любого из Гоблинов. Без сомнения можете
            также воспользоваться заклятием Копии.
                ПЕРВЫЙ ГОБЛИН
            Ловкость 8 Сила 10
                ВТОРОЙ ГОБЛИН
            Ловкость 6 Сила 8
            Если вы справились с охраной, то можете открыть дверь,
            которую они охраняли - 323.""",
        "goto":[323]
        },
    533: {
        "text": """Пройдя вдоль южной стены замка, вы видите, что
            тропинка раздваивается и можно либо немного углубиться в
            лес (305), либо свернуть и пойти вдоль западной стены (195).""",
        "goto":[305, 195]
        },
    534: {
        "text": """Вскоре после встречи с Зеленым рыцарем начинает
            смеркаться. Решив не рисковать, сходите с дороги и
            устраиваетесь на ночлег, а с первыми лучами солнца вновь
            продолжаете путь. Через несколько часов вы выходите на
            перекресток. Но откуда прискакал всадник? Это неизвестно,
            и поэтому выбор дороги занимает больше времени, чем обычно.
            К тому же вы понимаете, что замок может быть неподалеку:
            ошибиться именно сейчас было бы особенно обидно. Куда же
            все-таки надумаете пойти: прямо (584) или направо (60)?""",
        "goto":[584, 60]
        },
    535: {
        "text": """Вы решаете, что осторожность превыше всего, и
            говорите, что идете в Черный замок наниматься на службу.
            Старичок приторно любезен, но не более того. По крайней
            мере все ваши вопросы отскакивают от него, как от стенки
            горох. По его словам, он так долго не покидал свой дом, что
            просто не знает, что творится вокруг.
            "А куда идет тропинка от вашего дома"? - спрашиваете вы.
            "Какая тропинка? - искренне удивляется старичок. - Когда я
            последний раз выходил на двор, никакой тропинки не было".
            Вы понимаете, что ничего толком не добьетесь, и уходите по
            той самой тропинке, про которую спрашивали - 55.""",
        "goto":[55]
        },
    536: {
        "text": """Завернув за угол коридора, останавливаетесь как
            вкопанный. Перед вами - Зеленый рыцарь. Его меч поднят для
            удара, забрало опущено. "Пропуск", - глухо доносится из-под
            шлема. Если у вас есть Оберег или серебряный сосуд, можете
            попытаться воспользоваться ими. Иначе вам придется либо
            подумать о том, что может послужить пропуском (283), либо
            атаковать (567).""",
        "goto":[283, 567]
        },
    537: {
        "text": """Вы возвращаетесь к коридору, из которого пришли, и
            сворачиваете направо, подальше от темницы - 140.""",
        "goto":[140]
        },
    538: {
        "text": """В воздухе появляется огненный шар и направляется к
            одному из стариков. К вашему огромному разочарованию,
            старик щелкает пальцами, и шар исчезает. Теперь можете или
            попробовать заклятие Иллюзий (370), или же спокойно ждать,
            что будет дальше (68).""",
        "goto":[370, 68]
        },
    539: {
        "text": """Гоблин успевает позвать на помощь. Вам же приходится
            обнажать меч и драться.
                ГОБЛИН
            Ловкость 4 Сила 8
            Как только вы убиваете Гоблина, из дома появляется еще один.
            Он менее пьян и будет не столь легким противником.
              ВТОРОЙ ГОБЛИН
            Ловкость 8 Сила 10
            Когда удастся убить и второго Гоблина, остальные решат не
            искушать свою судьбу и убегут, выпрыгнув в окно. Вы же
            можете зайти в сторожку и посмотреть, нет ли там чего-нибудь
            для вас полезного (484), или решить, что лучше сразу пойти
            к зданию в центре двора (308).""",
        "goto":[484, 308]
        },
    540: {
        "text": """Вы подходите к среднему сундуку. Есть ли у вас
            фигурный ключ? Если да, то можете попытаться его открыть -
            уж слишком замысловата замочная скважина. Иначе, если вы
            этого еще не делали, лучше заняться большим сундуком (474),
            маленьким (380) или вернуться на параграф с описанием
            большой залы (39).""",
        "goto":[474, 380, 39]
        },
    541: {
        "text": """Вы накладываете заклятие, но огонь не в силах
            уничтожить камень. Теперь вам придется сражаться с крысами.
            Если у вас есть меч Зеленого рыцаря, то вы знаете, какой
            параграф нужно посмотреть. Если нет - 494.""",
        "goto":[494]
        },
    542: {
        "text": """За дверью - небольшая комнатка, доверху набитая
            продуктами. Нетрудно догадаться, что это должна быть
            кладовка. Ну-с, посмотрим, чем питается гвардия волшебника.
            Наверно, дрянь какая-нибудь, но, если хотите, можете
            подкрепиться. Что вас больше привлекает: мясо (411) или
            овощи (578)? Если вы не рискуете есть эти припасы, выходите
            через дверь в правой стене (80).""",
        "goto":[411, 578, 80]
        },
    543: {
        "text": """Вы можете использовать заклятия Огня, Ловкости и
            Слабости. В этом случае решите, какое именно, и посмотрите
            параграф 365. Если же не надеетесь на магию, начинайте бой.
              ЗЕЛЕНЫЙ РЫЦАРЬ
            Ловкость 11 Сила 14
            Если вам удалось победить рыцаря, то идите по коридору
            дальше, пока не дойдете до двери - 241.""",
        "goto":[365, 241]
        },
    544: {
        "text": """В конце лестницы - еще одна дверь. Она легко
            поддается, и вы оказываетесь на узкой площадке, на которую
            выходят уже две двери. Какая из них вам больше нравится:
            правая (285) или левая (489)?""",
        "goto":[285, 489]
        },
    545: {
        "text": """Вы берете серебряный сосуд. Если решите открыть его,
            то 451, если предпочтете таскать его с собой - 650.""",
        "goto":[451, 650]
        },
    546: {
        "text": """Конь изо всех сил старается сбросить непрошенного
            седока, но поначалу вам везет - в седле удержались.
            Рассчитывая избавиться от вас, конь пускается отчаянным
            галопом. Но не по дороге, а в сторону от нее - по тропинке,
            которую вы сначала даже не заметили. Как вы ни стараетесь,
            укротить строптивое животное не удается. Тропинка выходит
            на другую дорогу, и вы некоторое время скачете по ней,
            проезжаете под каким-то мостом, потом опять начинаются едва
            заметные лесные тропы. Через три четверти часа уже
            начинаете жалеть, что связались с этой лошадью: твердая
            земля кажется недостижимым раем. В конце концов конь, как
            бы услышав молитвы седока, сбрасывает вас (потеряйте 1 СИЛУ)
            и со скоростью ветра уносится в лес. Оглянувшись вокруг,
            пытаетесь понять, куда же вы попали - 181.""",
        "goto":[181]
        },
    547: {
        "text": """Дверь заперта, и на ней висит большой замок, который
            не сбить даже мечом. Если вам есть чем открыть дверь,
            сделайте это, иначе придется идти в другую - 501.""",
        "goto":[501]
        },
    548: {
        "text": """Вы входите в конюшню и приближаетесь к Пегасу. Конь
            выглядит очень мирно и, кажется, даже рад вашему приходу.
            Погладите его (297) или поторопитесь уйти, пока не вернулись
            конюхи (416)?""",
        "goto":[297, 416]
        },
    549: {
        "text": """Вы поворачиваете направо вдоль стены и продолжаете
            путешествие в темноте. В конце концов ваши руки нащупывают
            дверь, потом дверную ручку. Повернув ее и открыв дверь, вы
            несколько секунд стоите неподвижно, пока глаза привыкают к
            свету. Перед вами лестница. Обрадовавшись, что наконец-то
            можно уйти из этой непроглядной тьмы, спускаетесь вниз на
            несколько пролетов и видите еще одну дверь. Открыв ее,
            попадаете на узкую лестничную площадку, с которой ведут
            уже две двери. Какую из них вы откроете: правую (285) или
            левую (489)?""",
        "goto":[285, 489]
        },
    550: {
        "text": """Начальник стражи дотрагивается до ближайшей стены, и
            она отходит в сторону, открывая выход на лестницу - 607.""",
        "goto":[607]
        },
}
