d = {0:{
    "text":{0:
"""ПРЕДИСЛОВИЕ 
В самое обыкновенное сказочное королевство приходит беда.
В тихом лесу, на его юго-западных границах, появляется хитрый и коварный волшебник Барлад Дэрт,
в совершенстве овладевший искусством черной магии.""",

1:"""Никто не знает, из каких земель он пришел и что его привело на земли Элгариола.
Вскоре окрестные жители начинают сторониться леса,
который темные колдовские силы сделали таинственным и непроходимым,
с множеством беспощадных ловушек и мерзких глубоких болот.""",
            
2:"""Лес наводнили Гоблины и Орки - уродливые и жестокие воины Барлада Дэрта.
А в самом центре леса, который теперь называют не иначе как Зачарованным,
волшебник воздвиг Черный замок, и никому еще не удавалось увидеть его
и безнаказанно вернуться обратно. 
Но чародей не успокаивается на достигнутом.""",
            
3:"""Узнав, что во дворце живет прекрасная Принцесса - единственная дочь Короля, - он посылает
к ее отцу черных послов просить руки очаровательной девушки.
Гордый Король Элгариола отказывает, но послы появляются еще дважды.
Каждый раз они спускаются с неба на могучих крылатых конях,
и только Король может без страха смотреть им в глаза, столь большая
и грозная сила таится за ними.""",
            
4:"""Но монарх непреклонен, хотя и понимает: Барлад Дэрт так просто не откажется от своих намерений. 
И вот, когда послы в третий раз покидают дворец, Принцесса исчезает вместе с ними.
Заклятие волшебника переносит ее в Черный замок.
Однако она, достойная дочь своего отца, бесстрашно отказывается стать женой чародея, и тот,
не в силах сдержать свою злобу, погружает ее в волшебный сон. """,
            
5:"""По всему королевству герольды созывают смельчаков, обещая любую награду тому, кто освободит Принцессу.
Один за другим покидают они столицу по Главному Южному тракту
и исчезают  в Зачарованном лесу.
Но ни один не возвращается назад: Черный замок умеет беречь свои тайны. 
Хотите попытаться миновать западни Зачарованного леса, сразиться с беспощадными
воинами Барлада Дэрта, проникнуть в Черный замок и разрушить колдовские чары?
Если да, то собирайтесь в путь - книга поможет вам перенестись в сказочное королевство... """
,

6:"""Как и положено в сказках, путешествие начинается перед королевским дворцом.
Узнав, зачем вы пришли, стражники провожают вас в тронный зал, и вы предстаете перед Королем.
Обрадованный тем, что есть еще в королевстве герои, готовые рискнуть своей жизнью ради его дочери,
он отправляет вас к придворному астрологу и волшебнику, магу Белого Круга Майлину.
Ведь вам придется сражаться не только с воинами, но и со злыми духами - без волшебства в дороге не обойтись. 
Однако даже Майлин не может предвидеть всех ловушек Барлада Дэрта, да и времени на учебу у вас совсем мало.
Он лишь успевает научить вас самым необходимым заклятиям и дать несколько советов.
Вот заклятия, которые вам предлагаются для изучения: """,

7:"""ЗАКЛЯТИЕ ЛЕВИТАЦИИ - с его помощью вы сможете подняться в воздух и перелететь
то препятствие, которое вам встретится.
Но будьте осторожны: заклятие действует не слишком долго,
и если вы не рассчитаете свои силы, то можете опуститься на землю раньше,
чем препятствие или опасность будут позади. 
ЗАКЛЯТИЕ ОГНЯ - поможет вам в нужный момент создать в воздухе огненный шар и направить его на врагов.
Но в лесах и закрытых помещениях им надо пользоваться осмотрительно,
чтобы не устроить пожар. 
""",
            
8:"""ЗАКЛЯТИЕ ИЛЛЮЗИИ - вы создадите у вашего врага необходимую иллюзию
и сможете спастись в тех ситуациях, из которых другого выхода не будет.
Но заклятие иллюзии - опасное колдовство: ведь иллюзия рассеивается,
и враг понимает, что его одурачили. Кроме того, это одно из немногих заклятий,
требующих особой концентрации сил и хотя бы некоторого времени.
Если на вас уже напали, воспользоваться иллюзией вы просто-напросто не успеете. 
ЗАКЛЯТИЕ ЛОВКОСТИ - прибавит вам ловкость, но только на время одного боя.""",

9:"""ЗАКЛЯТИЕ СЛАБОСТИ - сделает вашего врага неуклюжим и неповоротливым,
ослабит МОЩНОСТЬ его УДАРА. 
ЗАКЛЯТИЕ КОПИИ - с его помощью можно будет при случае создать точную Копию вашего противника,
которую вы будете контролировать.
Тогда, прежде чем атаковать вас, ему придется драться с собственной Копией,
ЛОВКОСТЬ и СИЛА которой будут равны его ЛОВКОСТИ и СИЛЕ.
Если ваш враг победит свою Копию, то с ним придется драться вам самим.
Если же Копия сразит противника, то заклятие теряет силу и Копия исчезает,
а вы продолжаете свой путь. Однако если противников было несколько,
а Копию вы смогли или захотели создать только одну, то с остальными придется драться. 
""",
            
10:"""ЗАКЛЯТИЕ ИСЦЕЛЕНИЯ - в любой момент (но не во время сражения) добавит вам 8 СИЛ.
Впрочем, вы можете накладывать его не только на себя, но и на любое живое существо. 
ЗАКЛЯТИЕ ПЛАВАНИЯ - вы никогда не видели ни реки, ни озера,
а в дороге может случиться всякое.""",
            
11:"""Очевидно, что времени учиться плавать уже нет.
Но с помощью этого заклятия вы сможете переплыть любую водную преграду,
которая вам встретится (если ее смог бы преодолеть достаточно опытный пловец).
Однако будьте внимательны: как только вы вступите на землю, заклятие утратит свою силу.
Обрадовавшись такой сильной магической поддержке, торопите Майлина с обучением.
Однако не спешите: неопытный ученик мага способен без риска для своей жизни воспользоваться
заклятиями только 10 раз.
Более того, вы не успеете научиться свободно владеть ими,
так что Майлину придется для каждого применения любого из них сказать вам
свое особое волшебное слово.
Поэтому можете выбрать какие угодно заклятия и в любом количестве,
но всего их должно быть не более десяти.
Определите их заранее прямо сейчас.""",
12:"""Помните: каждое заклятие используется только один раз,
после этого вам придется его вычеркнуть и обходиться оставшимися. 
Конечно, вы не знаете, какие враги и преграды встретятся вам на пути.
Правильный выбор должны подсказать только ваш опыт и интуиция. 
Майлин дает еще два совета.
Во-первых, сориентироваться на запутанных лесных тропинках и в замке,
если вы до него дойдете, может помочь карта.
Во дворце такой карты нет, так что, если хотите,
не забывайте рисовать ее по мере продвижения.
Во-вторых, для многих магических таинств необходимы волшебные предметы.
Старайтесь в своем путешествии добыть их как можно больше.
При случае не исключено, что они помогут вам, но будьте осторожны:
коварство врага не знает границ, возможны любые ловушки. 
После беседы с астрологом вы вновь предстаете перед Королем.""",
13:"""Никто не знает, что вам может понадобиться на пути к успеху,
поэтому из дворца вы берете с собой только самое необходимое: меч, флягу
(можете дважды попить из нее, и каждый глоток восстановит 2 СИЛЫ), заплечный мешок и 15 золотых.
Король приказывает одному из герольдов проводить вас до начала Зачарованного леса,
чтобы в пути вы не испытывали нужды ни в еде, ни в питье.
По дороге вы спрашиваете своего спутника,
кто такие Гоблины и Орки, о которых вы много слышали во дворце.
Если ему верить, то Гоблины - это страшные и отвратительные злые духи ростом примерно с человека,
которые верой и правдой служат волшебнику. Их мало кто видел.
И совсем уж никто и никогда не видел Орков.
Говорят только, что они повыше и посильнее.
Но и с теми, и с другими лучше не встречаться. 
В пути вы еще раз обдумываете последний совет Майлина:
Барлад Дэрт достаточно могущественный волшебник,
чтобы даже малой частицы его мастерства,
переданной особо доверенным воинам, хватило не только на то,
чтобы противостоять вашим заклятиям,
но и наложить на вас свои, не менее быстрые и сильные. Будьте осмотрительны!""",
14:"""Но вот королевским владениям приходит конец. Здесь надо спешиться: лес заколдован и не пустит всадника. Герольд прощается, и вскоре лишь далекий стук копыт напоминает, что вы были не один. Черный, таинственный и неподвижный Зачарованный лес ждет вас.
Если вы готовы к тем неожиданностям, с которыми вам придется встретиться, тогда вперед, и да сопутствует вам удача! 
"""}
    },
     1 :{"text": """
Вы быстро идете вперед и вскоре оказываетесь в лесу.
Даже странно, что о нем рассказывают столько страшных и невероятных историй:
таинственный, зачарованный, с множеством ловушек и опасностей.
Пока все тихо и спокойно, высокие и могучие деревья справа и слева пропускают достаточно солнечного света,
дорога прямая и ровная, и вы немного расслабляетесь.
Тем более что веселое щебетание птиц убеждает в том, что поблизости нет никакой опасности.
По крайней мере, пока нет. Примерно через три четверти часа вы доходите до развилки.
Путь раздваивается. Теперь вам предстоит принять первое решение - какую дорогу выбрать.
Вы пойдете: 
По правой дороге? - 86. 
По левой дороге? - 110.""",
     "goto": [86, 110]},
     2 :{"text": """
Вскоре деревья расступаются, и дорога начинает петлять меж высоких холмов. Однако лес не выпустил вас из своих владений: поблизости и справа и слева виднеется высокая стена зарослей. Дорога становится совсем узкой, и вот уже по ней едва может пройти один человек, а два холма по краям почти нависают над вами. На правый холм поднимается еле заметная тропинка. Подняться по ней? Но вдруг вас заметит кто-нибудь из слуг Барлада Дэрта? Чутье подсказывает вам, что вперед идти не менее опасно. Что вы сделаете? 
Подниметесь на холм? - 175. 
Пойдете дальше по дороге? - 97.""",
     "goto": [175, 97]},
     3 :{"text": """
Да, видимо, Черный замок должен быть где-то неподалеку.
Напоследок лес делает все, чтобы удержать вас: сучья цепляются за одежду, ветви хлещут по лицу, корни и коряги как будто выползли из земли погреться и заставляют идти медленно и осторожно. Неожиданно впереди появляется слабый свет. Но как же он отличается от яркого весеннего солнца, которое радостно светило, когда вы только-только входили в Зачарованный лес! Тучи и облака плотно закрыли небо, пропуская лишь неясное и бледное марево. Однако не смотря на это, вы с облегчением покидаете негостеприимный лес - 211. """,
     "goto": [211]},
     4 :{"text": """
Через несколько минут вы достигаете реки.
На другом ее берегу разбиты палатки, горят костры, между которыми снуют Гоблины и Орки. Река подходит к высокому центральному строению и заканчивается у него, как дорога у ворот, но по шуму воды вы понимаете, что она небольшим водопадом стекает куда-то вниз, в подземелье. Теперь вы можете либо вернуться обратно и направиться к зданию в центре двора (416), либо попытаться перебраться через реку и проникнуть в лагерь врага (тогда вам надо решить, каким заклятием вы воспользуетесь: Плавания (164) или Левитации (633)), либо воспользоваться заклятием Плавания и поплыть по течению реки, надеясь проникнуть в подземелье замка (596). """,
     "goto": [416, 164, 633, 596]},
     5 :{"text": """Куда вы поплывете - к острову (216) или на другой берег (517)?""",
     "goto": [216, 517]},
     6 :{"text": """Сражаться с двумя Дровосеками вам придется одновременно. 
ПЕРВЫЙ ДРОВОСЕК 
Ловкость 8 Сила 4 
ВТОРОЙ ДРОВОСЕК 
Ловкость 6 Сила 7 
Вы можете воспользоваться заклятием Копии. Если вы победили их, то наградой вам будет всего 1 золотой в кармане Первого дровосека. Дровосеки люди работящие и небогатые, вряд ли стоило убивать их. Киньте кубик и зачеркните выпавшее на нем число на квадратах УДАЧИ (если оно уже зачеркнуто, считайте, что вам повезло). А теперь пора идти дальше - 490. """,
     "goto": [490]},
     7 :{"text": """ Вы пытаетесь сосредоточиться на заклятии Копии. Но, к вашему ужасу, копия не появляется! Рыцари развеяли заклятие, после чего второй бросает копье, и оно ранит вас на излете. Потеряйте еще 2 СИЛЫ. Теперь вы можете или попробовать заклятия Ловкости (36), Слабости (314), Огня (112), или же надеяться только на свой меч и драться (183). """,
     "goto": [36, 314]},
     8 :{"text": """Вы быстро обшариваете карманы Гоблина и находите изящный бронзовый свисток (- 214). На ходу кладете его в заплечный мешок (если, конечно, хотите) и идете к мосту - 118. """,
     "goto": [214, 118]},
     9 :{"text": """Заклятие действует успешно, и вы перелетаете через реку - 222. """,
     "goto": [222]},
     10 :{"text": """ Впереди - узкий длинный коридор. Через несколько шагов вы видите с левой стороны дверь. Войдете в нее (399) или пойдете дальше по коридору (251)? """,
     "goto": [399, 251]},
     11 :{"text": """Вы отстегиваете флягу от пояса и протягиваете ее несчастному. Он делает два больших глотка (отметьте на листке, что фляга пуста, однако можете взять ее с собой и при случае наполнить снова) и с облегчением откидывается на землю. Потом просит вас наклониться пониже и из последних сил шепчет: "Спасибо... за доброту. Попробую отблагодарить тебя. Там... дальше по дороге... будет развилка. Иди налево и... увидишь две березы на холме... копай между ними. Там я спрятал все, что у меня было...". Если вы ему поверили, то, когда увидите две березы, прибавьте 140 к номеру параграфа, на котором будете находиться, и попробуйте поискать клад. Теперь же, сделав все, что можно для умирающего разбойника, пора идти дальше - 234""",
     "goto": [140, 234]},
     12 :{"text": """Вы проходите через небольшую дубовую рощицу и выходите к озеру. Оно огромно - другого берега почти не видно. Вы можете или попробовать построить плот и перебраться через озеро на нем, или использовать заклятия. Что вы сделаете? 
Построите плот - 312. 
Воспользуетесь заклятием Плавания - 201. 
Воспользуетесь заклятием Левитации - 425. """,
     "goto": [312, 201, 425]},
     13 :{"text": """Прячась за деревьями, начинаете обходить деревню. Поселение оказывается не маленьким, и вы начинаете опасаться, как бы не встретить в лесу кого-нибудь из жителей: ведь они могут подумать, что вы следите за ними... К счастью, удается остаться незамеченным, и вы опять выходите на лесную дорогу. Ту же самую или другую? Нет, все-таки другую: она гораздо больше, да и разбитая колея говорит о том, что пользуются ей не так редко, как можно было бы ожидать. Вы можете пересечь дорогу и идти дальше в обход деревни (360), выйти на дорогу и пойти к деревне (580) или выйти на дорогу и пойти от деревни (235)""",
     "goto": [360, 580, 235]},
     14 :{"text": """ПРОВЕРЬТЕ СВОЮ УДАЧУ. Если вы удачливы, то 338. Если нет, то ваше решение принято слишком поздно - 404. """,
     "goto": [338, 404]},
     15 :{"text": """ Вы подзываете хозяина поближе и, выхватив меч, нападаете на него. Первый удар ваш, и он попадает в цель. Водяной ранен: ему ничего не остается, кроме как принять бой. Он будет сражаться с вами водорослями, каждый удар которых оставляет острые, глубокие, долго не заживающие порезы (и вам придется вычитать у себя не 2, а 3 СИЛЫ). Вы можете воспользоваться заклятиями Ловкости (417), Слабости (228), Огня (521) или драться с ним без помощи магии (326). Воспользоваться же заклятием Копии вам не удастся: обладая немалой собственной магией, хозяин таверны этого не допустит. """,
     "goto": [417, 228, 521]},
     16 :{"text": """ Дверь со скрипом открывается, и вы входите внутрь. Неожиданно чьи-то крылья бьют по лицу, и сильный укус в плечо вызывает резкую боль (потеряйте 1 СИЛУ). Вам придется сражаться с Летучими мышами - давними обитателями заброшенного домика. Если воспользуетесь заклятием Ловкости, можете на время боя увеличить свою Ловкость на две единицы. Предпочтете ослабить мышей, уменьшите на столько же МОЩНОСТЬ УДАРА любой из них. Помимо этого вы можете воспользоваться заклятиями Копии, Огня (557) и начинать бой. На ваше счастье Летучие мыши не вооружены мечами, поэтому каждый их удар, попавший в цель, отнимет у вас не 2, а только 1 СИЛУ. 
ПЕРВАЯ ЛЕТУЧАЯ МЫШЬ 
Ловкость 10 Сила 4 
ВТОРАЯ ЛЕТУЧАЯ МЫШЬ 
Ловкость 8 Сила 8 
ТРЕТЬЯ ЛЕТУЧАЯ МЫШЬ 
Ловкость 8 Сила 6 
Сражаться с ними вам придется одновременно. Если победите их, то можете откинуть ставни и осмотреть домик (120). Или же уйти и направиться к центральному строению (416). """,
     "goto": [557, 420, 416]},
     17 :{"text": """Теперь надо быстро придумать, что сказать. Предложите им все золото, которое у вас есть (426)? Признаетесь, что идете сражаться с волшебником и избавлять Зачарованный лес от нечисти (109)? Или попробуете намекнуть, что встречали по дороге кого-то из их знакомых (339)? """,
     "goto": [426, 109, 339]},
     18 :{"text": """Торговец говорит, что может сообщить кое-что интересное и полезное, но за информацию просит 7 золотых или какой-нибудь подарок. Заплатите ему (42), поищите в заплечном мешке подарок (217) или вежливо поблагодарите и уйдете (106)? А может быть, решите, что лучше убить его и обыскать лавку (518)? """,
     "goto": [42, 217, 106, 518]},
     19 :{"text": """Дорога приводит вас к большому красивому дому, стоящему справа от нее под двумя раскидистыми дубами. На пороге появляется высокий краснолицый человек, большой живот которого явно мешает ему быстро выбежать вам навстречу. Он вперевалочку направляется к вам и, представившись местным торговцем, предлагает зайти и сделать все покупки, необходимые в дороге. Решите, что он хочет заманить вас в ловушку, и пойдете дальше (185), или же поверите, что он торговец, и зайдете в дом (176)? """,
     "goto": [185, 176]},
     20 :{"text": """Дорога понемногу поворачивает направо, потом начинает петлять среди деревьев, и вскоре вы теряете ориентацию. К тому же смеркается, наступает ночь. На чистом бархатном небе разгораются золотые крапинки звезд. Хотите поискать место для ночлега (340) или пойдете дальше (442)? """,
     "goto": [340, 442]},
     21 :{"text": """Вы не успеваете толкнуть дверь, как она открывается сама: хозяин домика увидел вас в окно и поспешил навстречу. Он представляется проводником, помогающим найти дорогу в лесу заблудившимся путникам. Вы не заблудились? Тем лучше, но он все равно поможет выбраться отсюда. Подобная назойливость кажется слегка подозрительной. Но он словно не замечает вашего нежелания принять его помощь, приглашает в дом, кормит обедом (можете восстановить 2 СИЛЫ), а потом спрашивает, куда вы держите путь. Он просит за свои услуги всего 2 золотых и говорит, что без него вы просто не найдете дороги, а то и вовсе утонете в болотах, которых немало поблизости. Воспользуетесь его предложением и скажете, что ищете Черный замок (186), попросите проводить вас до ближайшего жилья (202) или откажетесь и уйдете (291)?""",
     "goto": [186, 202, 291]},
     22 :{"text": """ Вы внимательно осматриваете трон, но не находите в нем ничего примечательного. Судя по всему, ужас должен внушать не сам престол, а его хозяин. Но что-то подсказывает вам, что этому месту надо уделить побольше внимания. Повинуясь внезапной догадке, пробуете передвинуть трон, надеясь, что под ним что-то может быть. Внезапно одна из боковых дощечек сиденья с треском отскакивает, открывая секретный ящичек. В нем - короткая стрела с белым оперением (+ 137), которую можете взять с собой. После этого за дверью в той же стене, где вход, слышится громкий топот Гоблинов. Вам некогда задумываться, идут ли они ужинать или ваше присутствие обнаружено. Скорее решайте, через какую дверь уходить: правую (398), левую (206) или среднюю (350). """,
     "goto": [159, 398, 206, 350]},
     23 :{"text": """ Торговец говорит, что может сообщить кое-что полезное для вас, но просит за это 7 золотых или подарок. Заплатите ему (42), поищите в заплечном мешке подарок (217) или вежливо поблагодарите и уйдете (106)? А может быть, решите, что лучше убить его и поискать, нет ли чего интересного в лавке (518). """,
     "goto": [42, 217, 106, 518]},
     24 :{"text": """Если у вас есть еще заклятия Плавания или Левитации, используйте их и достигните другого берега озера (238). Если же нет, то фруктов вам хватит надолго, и вы еще сможете узнать, кто охраняет золотой апельсин и для чего он нужен. Но это будет еще не скоро... """,
     "goto": [238]},
     25 :{"text": """Буфет переполняют разнообразные сладости. Вы можете подкрепиться ими и восстановить 6 СИЛ. Если после этого решите уходить, сделайте это либо через дверь в той же стене, где вход (427), либо через одну из трех других: правую (398), левую (206) или среднюю (350). Если же захотите на свой страх и риск попробовать продолжить исследование столовой, - 125. """,
     "goto": [427, 398, 206, 350, 125]},
     26 :{"text": """Они со смехом отвечают, что не принимают воинов со стороны, а такие слабые и хилые, как вы, им вообще не нужны. В ответ встаете в оскорбленную позу и громко произносите: "Но меня призвал сюда сам чародей. Способны ли ваши тупые головы это понять?!" На лицах Орков появляется столь непривычное для них задумчивое выражение. Проверьте ваше ОБАЯНИЕ. Если все в порядке, то 624, если нет, - 105. """,
     "goto": [624, 105]},
     27 :{"text": """Лес меняется, теперь вдоль дороги растут только сосны, словно часовые, поставленные для того, чтобы не дать вам свернуть с выбранного пути. Примерно через полтора часа ходьбы вы приходите на развилку: от той дороги, по которой шли, отходит еще одна - направо. На перекрестке стоит покосившийся указатель, деревянная стрелка смотрит направо, но дожди давно уже смыли надпись, и разобрать ее не удается. Пойдете, куда указывает стрелка (514), или не будете сворачивать (35)? """,
     "goto": [514, 35]},
     28 :{"text": """Он вполне доволен вашим подарком - 443. """,
     "goto": [443]},
     29 :{"text": """Деревня кажется нескончаемой, но вот и еще одна дорога. Дальше пути нет: сплошной бурелом. Так что придется либо пойти по дороге (235), либо войти в деревню (580)""",
     "goto": [235, 580]},
     30 :{"text": """Вы спускаетесь по лестнице и открываете дверь - 10.""",
     "goto": [10]},
     31 :{"text": """Стражники спрашивают, чем же вы собираетесь торговать. Если у вас есть шкура лисы, покажите ее как образец и проходите, если же нет, ни одна другая вещь из вашего заплечного мешка не привлечет их внимания, и вам придется драться - 428.""",
     "goto": [428]},
     32 :{"text": """Вы всегда предпочитали белое вино и выбираете для пробы именно его. Но, всемогущие боги, что за кошмарный вкус! Оно явно предназначено не для людей. Постарайтесь не показать своего неудовольствия Троллю, потеряйте 1 ЛОВКОСТЬ и уходите через дверь в противоположном конце прохода между полками - 207.""",
     "goto": [207]},
     33 :{"text": """Вы входите внутрь и понимаете, что попали на Заставу, построенную здесь специально для того, чтобы не пропускать таких, как вы. Орк-часовой бросается на вас так стремительно, что вы даже не успеваете применить заклятия. 
ОРК 
Ловкость 9 Сила 8 
Если вы убили его, то сделали это как раз вовремя: из погреба с бутылкой вина поднимается Гоблин. Увидев вас, он бросает бутылку и хватается за боевой топор. 
ГОБЛИН 
Ловкость 7 Сила 8 Лояльность 6 
Во время этого боя вы, если хотите, можете попробовать убежать (143). Если его Лояльность станет меньше 3, он сам кинется в лес, не разбирая дороги. Если же вы убили Гоблина, то 239.""",
     "goto": [143, 239]},
     34 :{"text": """Вы так и не узнаете, кто были эти люди, но зато можете подобрать золотой свисток (+ 156), зеркальце (- 83) и небольшую эмблему в виде Черного замка (+ 59), оброненные ими во время боя. Скорее всего, это Беглецы из замка, и тогда вы на правильном пути - 3.""",
     "goto": [3]},
     35 :{"text": """Наступает ночь. Хотите отдохнуть и поспать после долгой дороги (204) или решите, что лес слишком опасен для этого и пойдете дальше (342)? """,
     "goto": [204, 342]},
     36 :{"text": """Вы накладываете заклятие Ловкости, и оно успешно действует. На время боя можете увеличить на 2 свою Ловкость - 183. """,
     "goto": [183]},
     37 :{"text": """Вы используете заклятие Огня, и огненный шар сжигает одну из голов Дракона. У вас есть еще одно заклятие Огня (344), или будете драться с оставшейся головой? Пока же она, не теряя понапрасну времени, дышит на вас пламенем (потеряйте 2 СИЛЫ). 
ДРАКОН 
Ловкость 10 Сила 6 
Если вы убили Дракона, то 454.""",
     "goto": [344, 454]},
     38 :{"text": """По дороге приходится идти так долго, что вам уже начинает казаться, будто это будет длиться вечно. Несколько раз вы проходите по мостикам, перекинутым над глубокими оврагами. Кажется, по дну оврагов тоже идут дороги или тропинки, но прыгать вниз как-то не хочется: слишком высоко. Наконец дорога приводит вас к покосившейся вросшей в землю деревянной хижине. Трудно определить, обитаема ли она. Можно только войти внутрь и все выяснить (221) или пройти мимо по тропинке дальше в лес (55).""",
     "goto": [221, 55]},
     39 :{"text": """Перед вами огромная зала, но определить, для чего она предназначена, довольно сложно. Мебели нет. В одном конце комнаты огромная парадная лестница поднимается вверх, такая же лестница, напротив, спускается вниз. Обе деревянные, перила богато украшены золотыми изображениями драконов и грифонов. Внимание привлекают окно в полстены по левую руку от вас и висящая поблизости картина. На ней изображена какая-то битва, но с того места, где вы стоите, деталей не разглядеть. В комнате три двери, однако открыть удается только одну - ту, что напротив окна. Пойдете через дверь (138), по лестнице вверх (523), по лестнице вниз (452), подойдете к окну (70) или к картине (205)? """,
     "goto": [138, 523, 452, 70, 205]},
     40 :{"text": """ Вам придется драться с ними одновременно, но вы можете воспользоваться заклятием Копии. 
ПЕРВЫЙ ГОБЛИН 
Ловкость 7 Сила 10 Лояльность 12 
ВТОРОЙ ГОБЛИН 
Ловкость 7 Сила 6 Лояльность 8 
Как только вам удастся уменьшить Лояльность любого из них до 3, Гоблин обратится в бегство, а Лояльность оставшегося опустится на 2 единицы. Если вы убили обоих, то 620, если только одного, - 652. Когда же удалось обратить в бегство всех, поторопитесь перейти реку: путь свободен - 118. """,
     "goto": [620, 652, 118]},
     41 :{"text": """Огонь прижигает Дракону отлетевшую голову - она больше не отрастет. Вы же продолжаете бой. 
ДРАКОН 
Ловкость 10 Сила 6 
Если вы победили Дракона и срубили вторую голову, ей уже не удастся отрасти - 454. """,
     "goto": [454]},
     42 :{"text": """Ваши деньги исчезают в огромном кошеле торговца - 443.""",
     "goto": [443]},
     43 :{"text": """Когда вы задаете свой вопрос, один из Орков невозмутимо дергает рычаг под столом, и вы летите куда-то вниз. Вероятно, спросили что-то не то... Когда вы падаете, то от удара теряете сознание (и 2 СИЛЫ впридачу)... - 409.""",
     "goto": [409]},
     44 :{"text": """Вы спокойно идете по дороге. Вдруг откуда ни возьмись перед вами появляется Волк. Но ваше удивление еще больше возрастает, когда он ударяется о землю и превращается в юношу-оруженосца. Оборотень говорит, что его заколдовал ненавистный Барлад Дэрт, так что он с радостью готов помочь вам. Ведь вы идете сражаться с волшебником, не так ли? Смелых людей видно издалека. Вы в нерешительности: предложение о помощи заманчиво, но вдруг это ловушка? Тем временем Оборотень рассказывает, что впереди будет перекресток. Самая опасная дорога оттуда - налево. Злой и коварный Дракон съедает каждого, кто пойдет по ней. Вам же надо идти прямо. Потом - развилка, и опять надо идти прямо, потому что на дороге, которая пойдет налево, устроили засаду воины жестокого мага. Поверите ему и скажете, что идете драться с волшебником (431) или же решите, что осторожность никогда не помешает, откажетесь от его помощи и пойдете дальше (240)? """,
     "goto": [431, 240]},
     45 :{"text": """Издалека пришла с волшебником его верная гвардия - Зеленые рыцари. Много лет назад маг разослал по деревням своих шпионов, чтобы они взяли на заметку тех юношей, сердца которых были подвержены Злу, чья жадность и жестокость вызывали удивление их родителей и товарищей. После этого к каждому было подослано по Оборотню с предложением служить у чародея. Шпионы хорошо поработали: ни один из юношей не отказался. Всего их было двадцать четыре. Барлад Дэрт поделился с ними своим мастерством и наложил на каждого колдовское заклятие. С тех пор они умели многое: развеивать заклятия врага, накладывать свои, но любимой их забавой в бою было направить на противника то заклятие, которым он хотел поразить их самих. Из юношей было отобрано трое - самых ловких и умелых. Им волшебник пожаловал баронское достоинство и доверял возглавлять походы своих войск. Лучший же был назначен Капитаном, начальником над всеми рыцарями. Ему-то маг и собирался перед смертью передать свой трон. Чтобы рыцарям легче было сражаться и побеждать, чародей заколдовал их щиты. Один раз взглянув, враг уже не мог отвести от них глаз. Теперь вы можете попросить либо книгу о самом волшебнике (345), либо о Принцессе (208), либо покинуть библиотеку через дверь в противоположной стене (627). """,
     "goto": [345, 208, 627]},
     46 :{"text": """Перед вами две дороги. Пойдете направо (445) или налево (524)? """,
     "goto": [445, 524]},
     47 :{"text": """Тропинка понемногу уводит назад, и вы понимаете, что возвращаетесь к опушке леса. Вокруг очень красиво: березовая роща горит на солнце, радуя глаз. Судя по всему, недавно прошел дождь, капли воды дрожат на листьях, и приходится обходить небольшие лужицы. Вскоре рощица кончается, только на холме рядом с дорогой стоят две невысокие березки, как бы оторвавшиеся от своих соседок и вышедшие из леса проводить вас. Тропинка понемногу расширяется, становится видно, что по ней часто ходят. Скорее, это уже даже не лесная тропинка, а дорога, которая вскоре поворачивает налево. Впереди показалась деревня. Но вам не обязательно идти в нее: еще одна дорожка, петляя, идет к лесу, который теперь оказывается не только позади, но и справа от вас. Направитесь к деревне (101) или к лесу (617)? """,
     "goto": [101, 617]},
     48 :{"text": """Миновав ворота, осторожно осматриваетесь в полутемном дворе замка. Прямо перед вами в центре двора - большое темное строение, но пока его сложно рассмотреть или хотя бы определить количество этажей. Однако хорошо видно, что сверху оно переходит в узкую высокую башню, которая, чем дольше вы смотрите, тем больше привлекает ваше внимание. Постепенно вас охватывает волнение, и вы понимаете, что наступают решающие минуты. Ведь в башне может быть или Принцесса, или Барлад Дэрт. В левом, дальнем от вас углу двора из-под низенькой башенки вытекает река и скрывается под кирпичными сводами. Входа внутрь не видно. Справа, немного в стороне от ворот, видна сторожка, откуда слышны веселые голоса Гоблинов и звон стаканов. Слева - невысокий одноэтажный домик, похожий на маленькую часовенку. 
Если вы пойдете к строению в центре двора - 308, 
если к сторожке - 218, 
если к маленькому домику слева - 116""",
     "goto": [308, 218, 116]},
     49 :{"text": """Вы успеваете сделать по дороге всего несколько шагов, как из-за поворота слышится приближающийся стук копыт. Что вы предпримете? Быстро вернетесь обратно на перекресток и пойдете в другую сторону (14)? Или останетесь на дороге, чтобы узнать, кто едет вам навстречу (404)? """,
     "goto": [14, 404]},
     50 :{"text": """Старик отвечает охотно: чувствуется, что ему давно не хватает человеческого общества. Вы узнаете, что некогда это была большая и веселая деревня, в которой жили охотники и грибники, известные на весь Элгариол. Да что там Элгариол - из Хайрингарда эльфы за грибами приезжали. Но с тех пор, как Барлад Дэрт превратил лес в свое королевство, добрым людям ходить туда опасно. Один за другим со слезами на глазах покидали жители деревню, где были похоронены их деды и прадеды. Старик остался последним: понимая, что скоро умрет, он решил не уходить из родных мест. Доверитесь ему и скажете, что вы идете в Черный замок сражаться с волшебником (310), попытаетесь осторожно выведать у него что-нибудь еще, не называя себя (418), или покинете деревню (179)? """,
     "goto": [310, 418, 179]},
     }
