d = {
151:{
'text': """Дорога, которую вы избрали, вновь возвращает вас к опушке леса. Но стоит вам выйти из него, как...
    дорога исчезает. Вы стоите посреди поля, лес рядом, рукой подать, но войти в него вновь никак не удается: сучья
    деревьев отбрасывают назад. Вы пытаетесь перехитрить лес - обойти его и найти ту дорогу, по которой входили. Через
    полтора дня вы действительно подходите к этому месту, но что это? Дорога заканчивается у опушки, не рискуя
    войти под кроны деревьев. Лес победил. Вам придется вернуться во дворец и признаться Королю, что не смогли
    выполнить возложенной на вас миссии. Однако почему-то кажется, что на следующее утро вы вновь предстанете
    перед лордом Элгариола и снова отправитесь в путь, чтобы освободить Принцессу. Хотя это будет уже совсем другая история...""",
'goto':[1]
},
152:{
'text':""" Вы дотрагиваетесь до зеркала, и оно
начинает поворачиваться вокруг своей оси, открывая черный провал потайного хода.
Взяв свечу со стола волшебника, переступаете порог. Дверь мягко закрывается, однако
когда вы пробуете снова ее открыть, то она поддается. Маг мертв, и волшебство,
заставляющее двери намертво захлопываться за вашей спиной, перестало действовать.
На много этажей вниз спускаетесь по темной лестнице, пока наконец не упираетесь в
такую же дверь. Она послушно поворачивается, и вы вступаете в святая святых замка:
небольшую залу, в которой душно от множества горящих свечей. В одной из стен - четыре
одинаковые двери. В центре залы на небольшом возвышении стоит хрустальная кровать, на
которой спит волшебным сном прекрасная девушка с распущенными золотыми волосами. Это
Принцесса, вы сразу узнаете ее, хотя лишь мельком видели во дворце ее портрет. Но чтобы
ее разбудить, надо приблизиться к ложу. Подойдете с правой (472) или с левой (275) стороны? """,
'goto':[472, 275]
},
153:{
'text': """   Попробуете наложить заклятие Огня (538) или Иллюзии (370)? Если нет ни того,
ни другого, остается только ждать, что будет дальше - 68. """,
'goto':[68]
},
154:{
'text':"""   Вы выбираете тропинку, ведущую направо, но она оказывается гораздо
длиннее, чем вы предполагали. Только к полудню пересекаете широкую дорогу, на которой
виднеются следы множества копыт. Можете выйти на дорогу и пойти по ней направо (559)
или налево (181), если же пойдете прямо по тропинке, то вскоре она выведет на другую дорогу (445).  """,
'goto': [559, 181, 445]
    },
155:{
'text': """   Вы просыпаетесь в лесу. Раннее утро, только-только начинают петь птицы,
однако никакой таверны поблизости нет. Ваш заплечный мешок и деньги исчезли. Водяной попросту
ограбил вас! Или все это приснилось? Так или иначе, надо двигаться вперед, другого выхода нет,
благо меч привычно висит на боку: на него никто не покусился. Наугад пробираясь через лес, вы все
же выбираетесь и не просто на дорогу, а на перекресток. Теперь можете идти дальше уже по дороге:
либо прямо (461), либо направо (250), очевидно, что путь налево приведет обратно к опушке. """,
'goto':[461, 250]
    },
156:{
'text': """  Вы берете пояс и надеваете на себя. Это Волшебный пояс: с его помощью можете в любой момент
(но только один раз за все путешествие) позвать на помощь крота. Он выроет ход, по которому сможете проникнуть
во двор Черного замка. Когда вы увидите замок, обратитесь к параграфу 167, если, конечно, будет
такое желание. Боги рады за вас: киньте кубик и почистите соответствующий квадрат УДАЧИ.
Теперь же пора выбираться из берлоги. С поляны в глубь леса ведет какая-то дорога, и вы решаете пойти по ней - 44.""",
'goto': [44]
},
157:{
'text': """ Вы заговариваете с женщинами, но что это... Ужас написан на их лицах. С громкими криками они убегают в
соседнюю комнату, а в дверь врывается стража. Зеленым рыцарям запрещен вход в гарем, кроме случаев крайней
необходимости. Но и тогда им не позволяется разговаривать с женами мага. Бой со стражей недолгий, неравный и
кровавый. Их слишком много. Последнее, что вы увидите в этом мире, будет короткий меч Гоблина""",
'goto':[1]
    },
157:{
  'text':  """ Вы врываетесь в сторожку и застаете там еще одного Гоблина и двух Орков, сидящих вокруг невысокого
деревянного стола. Перед ними кружки с какой-то жидкостью - стражники явно пьяны. Увидев ваш обнаженный клинок,
они сразу все понимают и беспрекословно кидают оружие к вашим ногам. Заперев их в погребе, можете осмотреть
помещение - 484. """,
'goto': [158]
},
159:{
    'text':""" К тому же вас клонит ко сну. Не в силах сопротивляться, вы решаете поспать часок-другой и ложитесь
на траву. Но вам не повезло: это луг, на котором растет силлиэл, сон-трава. И проснуться когда бы то
ни было уже не суждено - трава питается именно неосторожными путешественниками... """,
'goto': [1]
},
160:{
    'text':"""   Вы идете за стариком по коридору. Он безмолвно указывает путь. Попробуете напасть на него (371)
или пойдете дальше (276)""",
    'goto': [371, 276]
    },
161:{
    'text':"""  В деревне странно только одно - она совершенно пуста. Не слышно даже лая собак. Кажется,
все жители покинули ее, но вдруг вы видите дряхлого старика, как ни в чем не бывало сидящего возле одного из
домов на грубой, вросшей в землю скамье. Подойдете к нему поговорить (50) или пойдете дальше (179)?""",
    'goto':[50, 179]
    },
162:{
    'text':"""Вы дергаете за ручку, но дверь не открывается.
Осмотревшись, замечаете, что рядом висит шнурок звонка. Пожалуй, позвонить разумнее, нежели
ломиться силой. Рискнете сделать это (611) или пойдете в другую дверь (76)? """,
'goto':[611, 76]
    },
163:{
    'text':"""
      "Ты разгадал самую сложную мою загадку, - с радостью говорит Домик. - Более того, много десятков
      лет я загадываю ее прохожим, и ты первый, от кого я услышал правильный ответ. За это я расскажу тебе то, что
      не слышал от меня еще никто. Высок и полон тайн Черный замок, но пуще других волшебник бережет самую страшную
      тайну: где находится Принцесса. Ее-то я тебе и открою: несчастная девушка спит на хрустальной кровати в самом
      глухом подземелье замка, на самом нижнем этаже. Охраняют ее Зеленые рыцари. Когда пойдешь туда, то увидишь пять
      дверей. Про две из них тебе сразу все станет известно. Могу сказать только одно: птица лучше перьев.
      А три останутся загадкой. И эту загадку я помогу тебе отгадать. Левая дверь - смерть. Средняя и правая - кровь. Как
      видишь, легкого пути нет, но и знание можно использовать как оружие. Только человеку, который ведает, что
      такое Совесть, могу я доверить эту тайну". Вы благодарите Домик и, попрощавшись, идете дальше по дорожке,
      которая уходит в лес прямо от его дверей - 98.""",
    'goto': [98]
    },
164:{
    'text':"""Вы используете заклятие Плавания и незамеченным перебираетесь на другой берег реки - 424.""",
    'goto':[424]
    },
165:{
    'text':""" Вы подходите к зеркалу, но оно, как ни странно, самое обыкновенное и вряд ли может хоть
чем-то помочь. Теперь выбирайте: осмотрите шкаф (560) или карты на столе (288)? Если вы уже делали и то, и другое,
то 493.""",
    'goto':[288, 493]
    },
166:{
    'text':""" Вы платите деньги, и Начальник стражи выписывает пропуск на небольшом кусочке пергамента. Он
предупреждает, что пропуск действителен только на первые два этажа. Если понадобится предъявить его, прибавьте
20 к номеру параграфа, на котором будете находиться. Начальник стражи может проводить вас до лестницы, если
скажете ему, что вам надо на второй этаж (550), или же уходите через ту дверь, на которую он вам указывает -
в противоположной стене - 39. """,
    'goto':[550, 39]
    },
167:{
    'text':"""Волшебный пояс надет, и крот появляется сразу же, как только вы его зовете.
Выяснив, в чем дело, он принимается за работу. Меньше чем за
полчаса удобный подземный ход
к вашим услугам, после чего вы благодарите крота и, пройдя под стенами,.. - 100. """,
    'goto':[100]
    },
168:{
    'text':"""  Вы показываете рыцарю четки и понимаете, что угадали: они служат
пропуском через этот пост. Можете идти дальше по коридору, пока путь не преградит дверь - 241.""",
    'goto':[241]
    },
169:{
    'text':""" Вы склоняетесь над убитым, все еще не веря собственным глазам.
Если уже удалось разбудить Принцессу, то 655. Если же нет, то можете обратить
внимание на побежденного врага (612) или осмотреть его кабинет: подойти к шкафу (560),
посмотреть карты на столе (288) или приблизиться к зеркалу (165). """,
    'goto':[655, 612, 560, 288, 165]
    },
170:{
    'text':"""
      Неожиданно вы чувствуете, что Оберег ведет себя как-то неспокойно, словно
      хочет вырваться наружу. Повинуясь не совсем осознанному импульсу, вы вынимаете его из-под
      одежды и показываете рыцарям. Как ни странно, они низко кланяются. Ваш Оберег - не что иное,
      как пропуск, разрешающий беспрепятственно проходить через этот пост. Теперь можете взойти
      по лестнице и, оказавшись на небольшом балкончике, решить, какая из дверей вам больше
      нравится: правая (594) или левая (599). """,
    'goto':[594, 599]
    },
171:{
    'text':""" Вы достаете флакончик духов и протягиваете его женщине-вампиру. Она никогда не видела
ничего подобного и не представляет себе, что бы это могло быть. Однако непривычный запах ей нравится.
Пока она рассматривает подарок, можете быстро
выскользнуть в дверь слева, закрытую тяжелой портьерой - 301.""",
    'goto':[301]
    },
172:{
    'text':""" Вы накладываете заклятие, и оно действует, но... - 347.""",
    'goto':[347]
    },
173:{
    'text':"""  Вы открываете сундук, но... он пуст. Видимо, его только
временно принесли на кухню за неимением лучшего места. Если вы еще не
пробовали местной стряпни, можете наскоро похлебать суп из котла и
восстановить 2 СИЛЫ, после чего лучше будет побыстрее уйти - 379. """,
    'goto':[379]
    },
174:{
    'text':""" Ваше решение было несколько опрометчивым. Один из командиров, о существовании которых
вы уже наверняка забыли, наконец-то обращает на вас внимание и, подкравшись сзади, сносит голову
мечом. Вообще-то человек несколько отличается от Гоблина, так что распознать шпиона не составило
особого труда даже для Орка. Из-за своей беспечности вы не выполнили столь важную миссию... """,
    'goto':[1]
    },
175:{
    'text':"""    Вы поднимаетесь на холм и благополучно обходите внушающее
опасения место. Затем спускаетесь обратно на дорогу и продолжаете путь - 121. """,
    'goto':[121]
    },
176:{
    'text':"""
      Как ни странно, этот человек действительно торговец, обосновавшийся
      в лесу не так давно. По его словам, опасностей вокруг нет никаких, все это сказки
      да слухи, распускаемые теми, кому хочется прослыть героями, побывав в самом обычном лесу.
      Он предлагает вам свои товары: магические лепешки ценой в 3 золотых каждая (по его словам,
      помогают от укуса змеи)(+ 134), мандарин (стоит 2 золотых и восстановит вам 2 СИЛЫ),
      апельсин (1 золотой и 1 СИЛА), банан (6 золотых и 6 СИЛ), молоко (2 золотых и 3 СИЛЫ),
      мешочек с лепестками розы, отгоняющими злых духов, всего за 5 монет (- 49). За 4 золотых
      он предлагает наполнить вашу флягу целиком или за 2 наполовину. Если вы что-то хотите купить -
      покупайте. Молоко придется выпить сразу, а все остальное, если хотите, можете взять с собой.
      Если есть желание, купите еще и заплечный мешок - он стоит 8 золотых, но в него помещается больше,
      чем в ваш: не 7, а 9 предметов. Однако два заплечных мешка нести неудобно, и если свой у вас еще с
      собой, вы должны будете оставить его в доме у торговца. Так уж и быть, он даст вам за него две монеты.
      Теперь можете либо уходить (106), либо попробовать поговорить с ним еще (213). """,
    'goto':[106, 213]
    },
177:{
    'text':""" Вы с трудом пробираетесь через кустарник. Кажется, он
наконец-то заканчивается. Но что это? Земля уходит из-под ног, и вы по пояс
проваливаетесь в мерзкое, засасывающее болото. Забыв об осторожности, кричите во весь голос, зовете
на помощь, но все тщетно. Через несколько секунд вас засосет одна из ловушек, приготовленных Барладом Дэртом
для чересчур любопытных путешественников. Вы не выполнили свою миссию... """,
    'goto':[1]
    },
178:{
    'text':""" Вы гонитесь за зайцем, не разбирая дороги. Ветки хлещут по лицу, но голод
гонит все вперед и вперед. Неожиданно заяц жалобно пищит и начинает биться на земле. Подбежав
ближе, видите, что он попал в одну из охотничьих ловушек, наверняка поставленных кем-нибудь из
слуг волшебника. Если у вас есть огниво, можете воспользоваться им и приготовить обед. Если нет,
то вряд ли вы настолько голодны, что станете есть сырое мясо. К сожалению, найти дорогу обратно уже
невозможно, и вам приходится идти по тропинке, которая углубляется в лес от того места, где стояла ловушка - 406. """,
    'goto':[406]
    },
179:{
    'text':"""
      Никого более не встретив, выходите из деревни и углубляетесь в лес.
      Бодро убегающий вдаль путь не слишком радует, поскольку боязливо жмется к
      опушке. Вы же прекрасно знаете, что Черный замок надо искать где-то ближе к центру
      Зачарованного леса. Не успеваете об этом подумать, как видите тропинку, услужливо
      убегающую направо. Пойдете по ней (99) или решите, что дорога есть дорога, и она должна
      привести к цели (377)? """,
    'goto':[99, 377]
    },
180:{
    'text':""" Женщина-вампир выхватывает из ваших рук свисток и пронзительно свистит. Через несколько секунд в комнату вбегает охрана - пять Зеленых рыцарей. Перед смертью вы
еще успеете вспомнить, как достался вам этот свисток, и попытаться догадаться, для чего он служит на самом деле... """,
    'goto':[1]
    },
181:{
    'text':"""
      Впереди большая поляна, на которую выходят несколько дорог. Но вы не успеваете сообразить, какую из них выбрать. После тихого свиста, очевидно, послужившего сигналом, с разных сторон на поляну выскакивают трое. Достаточно одного взгляда, чтобы понять, что это разбойники, специально поджидавшие неосторожного путешественника. Лат на них нет, только рваные кожаные куртки и шаровары. И трудно сказать, не остался ли кто-нибудь еще в засаде. Вы можете сразу
      драться с ними, не ожидая пощады и надеясь выиграть время, нападая первым (123). А можете попытаться поговорить (17). """,
    'goto':[123, 17]
    },
182:{
    'text':"""  Сосуд оказывается скользким, как рыба, и со звоном разбивается об пол.
На шум вбегает стража - Орки, вооруженные кривыми зазубренными саблями. Вы пытаетесь сопротивляться, но
сильный удар по голове (потеряйте 2 СИЛЫ) сбивает с ног, и вы теряете сознание... - 409. """,
    'goto':[409]
    },
183:{
    'text':"""
      Вам придется не только драться сразу с обоими Зелеными рыцарями, но и вычитать 1 из своей Ловкости, поскольку вы стоите на земле, а они атакуют вас сверху, с коней. 
      ПЕРВЫЙ ЗЕЛЕНЫЙ РЫЦАРЬ 
      Ловкость 10 Сила 10 
      ВТОРОЙ ЗЕЛЕНЫЙ РЫЦАРЬ 
      Ловкость 10 Сила 10 
      Если вам удалось победить одного из рыцарей, то 436.""",
    'goto':[436]
    },
184:{
    'text':"""Они не очень удивлены вашим вопросом и кивают на дверь в противоположной стене.
В самом деле, им-то что - пусть Начальник стражи сам разбирается, имеете ли вы право разгуливать
по замку. Менять решение уже поздно, и вы открываете указанную дверь - 337.""",
    'goto':[337]
    },
185:{
    'text':"""Он еще не успевает приблизиться, как вы на ходу кричите, что вам некогда,
и идете дальше. Теперь перед вами три дороги. Куда вы пойдете:
направо (329), налево (432) или прямо (20)?""",
    'goto':[329, 432, 20]
    },
186:{
    'text':"""Проводник говорит, что мгновенно понял это, как только посмотрел
на вас. Он и сам ненавидит злого волшебника и уже помогал вашим предшественникам. Но не забыли ли
вы, что он берет за это 2 золотых? Заплатите (456) или откажетесь и уйдете (291)? """,
    'goto':[456, 291]
    },
187:{
    'text':""" Решительно сворачиваете с тропинки и поднимаетесь на холм к двум березам.
Вы не слишком-то поверили в этот клад, но почему бы не попробовать его поискать. Прикинув, г
де может быть середина между двумя деревьями, несколько раз втыкаете меч в мягкую землю, чувствуя
себя не совсем в своей тарелке. Наконец он во что-то упирается. Копать сразу становится гораздо интереснее.
Проходит немного времени, и деревянный ларец у вас в руках. Торопливо сбиваете замок. Внутри ларца лежат 10 золотых,
серебряное кольцо (- 105), потрепанная малиновая куртка (+ 58), непонятный механизм в позолоченном корпусе (- 251),
огниво (+ 111) и светильник (+ 10). Можете взять с собой все, что хотите, но учтите, что зажечь светильник без огнива
вам не удастся. Можете также бросить кубик и почистить соответствующий квадрат УДАЧИ. Теперь возвращайтесь на 47. """,
    'goto':[47]
    },
188:{
    'text':"""
      Через несколько часов за очередным поворотом дороги вы слышите шум обвала, чьи-то
      предсмертные крики, а затем громкий цокот копыт и звон оружия. Что бы впереди не
      происходило, лучше туда не ходить, и вы сворачиваете в лес. Идти по бездорожью тяжело и
      неудобно (потеряйте 1 СИЛУ), но мысль о том, что вы явно избежали какой-то опасности, радует
      и греет. Вскоре вы выходите на большую дорогу: слева виднеется деревня (вы очень удивлены, увидев
      многолюдную деревню в Зачарованном лесу, но дымки над хатами говорят, что жителей в ней немало),
      справа дорога скрывается за поворотом. Куда вы пойдете: налево (580) или направо (235)? """,
    'goto':[580, 235]
    },
189:{
    'text':""" Паук мертв, и вы можете посмотреть, что он хранил в своей паутине. А вещичек там не так
    уж и мало: 1 золотой, прекрасный бриллиант (- 189) и золотой свисток (+ 156). Можете взять с собой все,
        что пожелаете, спуститься с дерева и продолжить путь - 19. """,
    'goto':[19]
    },
190:{
    'text':"""
      Высокие каменные ворота наводят на мысль, что в замок будет легче
      пробраться, чем вернуться назад. Немного правее виднеется недокопанный ров, но сейчас
      все вокруг пусто, если не считать стражи: трех Орков не самого любезного вида. У двух - большие
      боевые топоры, у третьего - меч. Они вопросительно смотрят на вас, но что вы можете им сказать?
      Что вы бродячий торговец и идете в замок торговать (245), что вы азартный игрок и идете развлекать
      волшебника (449) или что собираетесь наняться на службу в его армию (26)? Если же у вас
      не хватает воображения, ну что ж, тогда сражайтесь - 341.""",
    'goto':[245,449,26,341]
    },
191:{
    'text':"""  Вы поднимаетесь по лестнице наверх и останавливаетесь перед закрытой дверью - 532. """,
    'goto':[532]
    },
192:{
    'text':""" Берег охраняется: как только вы достигаете его, из кустов выскакивает Гоблин и,
размахивая саблей, бросается на вас. Воспользоваться заклятиями уже не успеваете. 
      ГОБЛИН 
      Ловкость 7 Сила 9 Лояльность 12 
      Если его Лояльность опустится до 3, он бросит саблю и, громко топая, вновь
      скроется в кустах, а вы сможете отправляться дальше по тропинке, ведущей в лес (437). Если же вы убили его - 626.""",
    'goto':[437,626]
    },
193:{
    'text':"""
      Свеча на столе у Гоблинов догорела и погасла. Если у вас есть свеча
      или светильник, зажгите их, если же нет, - придется идти в полной темноте. Хорошо хоть
      догадались запомнить, где находился выход. За дверью начинается коридор. Однако чтобы нащупать
      дорогу, придется держаться за одну из стен. За правую (230) или за левую (352)?""",
    'goto':[230, 352]
    },
194:{
    'text':"""Что вы можете ей предложить? Перо павлина, серебряный браслет или стрелу с белым оперением? Если у вас нет ничего подходящего,
можете или дать денег, если еще не пытались этого сделать (137), или, на худой конец, пригрозить ей мечом (522). """,
    'goto':[137, 522]
    },
195:{
    'text':"""
      Увы, вам не суждено отойти далеко от развилки. Волшебник не любит людей,
      которые что-то выглядывают и вынюхивают, бродя вокруг замка. Вас заметил Орел - часовой
      над одной из башен, и наперерез из замка вышел небольшой отряд из 15 - 20 Гоблинов. Бой в лесу
      был суматошным, но недолгим. Приказ - уничтожить шпиона - они выполнили... """,
    'goto':[1]
    },
196:{
    'text':"""
      Вы надеваете на палец перстень с рубином (+ 49). Увы, снять с руки второй
      перстень вам уже не удается. Теперь можете осмотреть кабинет. Что прежде всего
      привлечет ваше внимание: шкаф (560), стол (288) или зеркало (165)?""",
    'goto':[560, 288, 165]
    },
197:{
    'text':"""
      По дороге мимо вас вихрем пролетает Зеленый рыцарь: на нем зеленые латы и шлем,
      в руке - копье. Это происходит так быстро, что вы не успеете выйти ему навстречу, даже если очень
      захотите. Так что вылезайте из укрытия и идите дальше - 534.""",
    'goto':[534]
    },
198:{
    'text':"""    Вы проходите через комнату и понимаете, что совершили ошибку. За стеной
звенит колокольчик, и при выходе вас встречает охрана. Короткий неравный бой, кто-то бьет сзади
по голове (потеряйте 2 СИЛЫ), и вы теряете сознание... - 346. """,
    'goto':[346]
    },
199:{
    'text':"""
      На следующей развилке стрелка снова указывает вам путь прямо. Неподалеку
      виднеется домик, у которого дорога и кончается. Направитесь к домику и войдете
      в него (107) или свернете по тропинке направо (304)? Однако учтите, что есть еще путь
      направо - дорога, уводящая в глубь леса - 332. """,
    'goto':[107, 304, 332]
    },
200:{
    'text':"""   Вы показываете рыцарю зеркальце, и, как ни странно,
этот маленький изящный предмет действительно оказывается пропуском. Зеленый страж отступает
в сторону, и вы быстро устремляетесь вперед по коридору, пока он не успел спросить что-нибудь еще.
В конце пути виднеется низенькая деревянная дверца, в замке которой торчит ключ. Вы поворачиваете его - 241. """,
    'goto':[241]
    },
201:{
    'text':""" Воспользовавшись заклятием Плавания, благополучно достигаете противоположного берега,
но на этом ваши приключения не заканчиваются - 192. """,
    'goto':[192]
    }
}

print(d[201])


