d = {
    601: {
        "text":"""
Пытаетесь  бежать, но  огненное дыхание  настигает вас. Потеряйте еще 6
СИЛ. Если остались живы, то  как можно быстрее торопитесь обратно в лес, где
Дракон не сможет вас преследовать - 232.""",
        "goto":[232]
        },
    602: {
        "text":"""
Вы  поворачиваете  на пальце  Золотое кольцо.  Гром потрясает замок  до
основания, и ваш противник замертво падает на пол - 169.""",
        "goto":[169]
        },
    603: {
        "text":"""
Дверь легко открывается, и вы попадаете в светлый  широкий коридор.  Но
откуда же падает свет? Этого определить нельзя - похоже, что по крайней мере
одна из загадок Черного замка останется неразгаданной - 643.""",
        "goto":[643]
        },
    604: {
        "text":"""
Вы  достаете  меч и  внезапно  наносите удар  ближайшему поваренку.  Он
падает замертво. Потом поворачиваетесь к повару.
     ПОВАР
     Ловкость 8 Сила 10 Лояльность 12
     Победить  его  не  слишком сложно,  однако,  пока вы  сражались, второй
поваренок успел куда-то спрятаться. У вас нет времени его искать, и остается
только  надеяться,  что  он  вылезет,  когда  вы  будете  уже  далеко.  Если
Лояльность Повара уменьшится до 3, он сдастся,  и вы сможете  запереть его в
одном из шкафов. Теперь, наконец-то,  можно заглянуть в сундук (173) или, не
рискуя, уйти из кухни (379).""",
        "goto":[173,379]
        },
    605: {
        "text":"""
Повинуясь какому-то не совсем осознанному стремлению, дотрагиваетесь до
Золотого амулета. Барлад  Дэрт немного привстает  со стула, заинтересованный
вашим  жестом,  но в  этот момент два  тонких острых  луча света из  амулета
пронзают его глаза. Вы так  никогда и не  узнаете, кто и когда изготовил эту
чудесную вещицу. Случайно ли  именно в этот момент  ваша рука  потянулась  к
нему,  или  вы лишь  игрушка  в  руках Судьбы  и богов? Остается  лишь  быть
довольным действием волшебного предмета - 169.""",
        "goto":[169]
        },
    606: {
        "text":"""
Решив  не доверять подозрительным  лесным указателям,  вы  сворачиваете
налево,  но уже через  несколько метров  можете  пожалеть о своем  выборе. С
быстротой  молнии откуда-то  сверху  на  вас набрасывается гигантский  Паук.
Наложить какое-либо заклятие, кроме заклятия Копии, уже некогда.
     ПАУК
     Ловкость 8 Сила 8
     Если  вы  победили  его,  придите  в  себя,  переведите  дух  и  можете
отправляться дальше - 19.""",
        "goto":[19]
        },
    607: {
        "text":"""
Вы поднимаетесь по лестнице на следующий этаж  и видите еще одну дверь,
которая, на ваше счастье, оказывается незапертой - 532.""",
        "goto":[532]
        },
    608: {
        "text":"""
Вы говорите  Дровосекам,  что  ищете Черный замок и... те  теряют к вам
всякий интерес. Они-то боялись, что вы ищете их деревню, а увидев острый меч
у вашего  пояса, стали подозревать недоброе. Успокоившись, они удаляются  по
дороге  в  ту  сторону, откуда вы пришли, а вы вскоре выходите  на развилку.
Куда теперь лежит ваш путь: прямо (214) или направо (38)?""",
        "goto":[214,38]
        },
    609: {
        "text":"""
Вы зовете Пегаса, и  он мгновенно  возникает  за окном. Сесть верхом  -
дело нескольких секунд. Дорога обратно занимает всего лишь около часа - и вы
во  дворце.  Поручение  Короля осталось невыполненным, но кто  мешает завтра
утром начать все сначала?..""",
        "goto":[232]
        },
    610: {
        "text":"""
Вы говорите, что идете в замок  драться с волшебником. Может  быть, это
несколько опрометчиво, но лес еще не успел научить вас осторожности - 555.""",
        "goto":[555]
        },
    611: {
        "text":"""
Дверь тут же открывается в тесную узкую комнату. Посредине ее - проход,
по краям - полки, уставленные бутылями самых невероятных цветов  и размеров.
Вы оказались в винном  погребе, и навстречу идет его хозяин - Тролль. Как ни
странно,  не  спрашивая,  кто  вы,  он  любезно  предлагает отведать вина  -
красного  (128)  или  белого (32). А может  быть,  эля  (226)?  Примете  его
предложение или будете драться с ним (356)?""",
        "goto":[128,32,226,356]
        },
    612: {
        "text":"""
Ваше  внимание  прежде всего  привлекают руки  волшебника. На  них  два
перстня:  с  рубином  (196) и  изумрудом  (258).  Возьмете один из  них  или
вернетесь на 169 и осмотрите кабинет?""",
        "goto":[196,258,169]
        },
    613: {
        "text":"""
За кругленькую сумму  в 10 золотых он готов не только посмотреть сквозь
пальцы  на  ваше  довольно-таки подозрительное  пребывание  в  замке,  но  и
выписать пропуск. Согласитесь на его условия (166) или будете драться (65)?""",
        "goto":[166,65]
        },
    614: {
        "text":"""
Вы  быстро  используете  еще  одно  заклятие  и  достигаете  берега. Но
передохнуть вам не удается - 192.""",
        "goto":[192]
        },
    615: {
        "text":"""
Вы  пробираетесь  за Обезьяной  по  лесу, пока она  не выводит  вас  на
какую-то дорожку и исчезает в чаще - 232.""",
        "goto":[232]
        },
    616: {
        "text":"""
Открыв  дверь, вы попадаете в Гостиную. Уютные диваны и кресла, картины
в золоченых рамках, вазы на столиках - все навевает покой. Однако выходов из
комнаты не видно. Но вот из-за ширмы появляется и хозяйка - красивая женщина
с  тонким  капризным лицом, в  легком летнем платье. На  ее лице  играет  не
слишком уверенная улыбка. Попробуете откупиться от нее каким-нибудь подарком
(52), достанете меч и будете биться (93) или поговорите с ней (654)?""",
        "goto":[52,93,654]
        },
    617: {
        "text":"""
Через четверть часа  -  снова в лесу. Вы  путешествуете  уже достаточно
долго, но так  и не смогли  углубиться в  чащу, а  ведь известно, что Черный
замок - сердце Зачарованного леса. Киньте кубик и зачеркните выпавшее на нем
число на квадрате УДАЧИ (если оно уже зачеркнуто, вам повезло). Тем временем
перед вами новая развилка.
     Пойдете направо? - 117.
     Или налево? - 303.""",
        "goto":[117,303]
        },
    618: {
        "text":"""
Паук затягивает  вас на дерево,  и вам  приходится  сражаться с ним. Во
время  боя уменьшайте вашу  МОЩНОСТЬ  УДАРА  на  1 - ведь  вы  не слишком-то
привыкли драться на деревьях.
     ГИГАНТСКИЙ ПАУК
     Ловкость 9 Сила 8
     Пользоваться заклятием Огня на дереве неразумно, Копии же просто  негде
будет   поместиться.   Однако  вы  можете  воспользоваться  заклятиями  либо
Ловкости, которое позволит вам прибавить  2 к своей Ловкости, либо Слабости,
которое уменьшит на 2 МОЩНОСТЬ УДАРА противника. Если вы победили, то 189.""",
        "goto":[189]
        },
    619: {
        "text":"""
Шум боя  гулко  разносится  по  коридорам  замка,  и  подоспевший отряд
Гоблинов врывается раньше,  чем  вы  успеваете добить  вашего  врага. Даже в
самых кошмарных снах не приснится то, что они сделали с вами...""",
        "goto":[1]
        },
    620: {
        "text":"""
Можете забрать у них бронзовый свисток (- 214) и медный ключик (- 164),
которые им больше не понадобятся, и перейти реку - 118.""",
        "goto":[214,164,118]
        },
    621: {
        "text":"""
Довольный  возможностью подзаработать,  он наливает вам тарелку горячих
щей. Восстановите  4 СИЛЫ  и уходите:  у повара больше нет  времени  с  вами
заниматься (379). Если же вы намерены любой ценой заглянуть в сундук, повара
и его подручных нельзя оставлять в живых - 604.""",
        "goto":[379,604]
        },
    622: {
        "text":"""
Вам повезло: в последний  момент замечаете маленькую пещерку у подножия
одного  из  холмов.  Есть  ли  там  обитатели,  раздумывать  некогда  -  это
единственный шанс. К счастью, в пещерке никого нет, и обвал проносится мимо.
Вы выбираетесь и,  благословляя счастливую  Судьбу, отправляетесь  дальше  -
121.""",
        "goto":[121]
        },
    623: {
        "text":"""
Понимая,  что сопротивление бесполезно, Гоблин  сдается. Решив пощадить
ему жизнь, привязываете врага к ближайшему дереву  и быстро  обшариваете его
карманы. Добыча  невелика: всего лишь изящный бронзовый свисток (-  214). На
ходу кладете его в заплечный мешок (если, конечно, хотите) и идете к мосту -
118.""",
        "goto":[188]
        },
    624: {
        "text":"""
Ваши глаза горят праведным гневом, а голос настолько уверен и напорист,
что Орки, почесав в затылках, пропускают вас - 100.""",
        "goto":[100]
        },
    625: {
        "text":"""
Куда вы направитесь, используя заклятие?
     К острову? - 413.
     На другой берег? - 425.""",
        "goto":[413,425]
        },
    626: {
        "text":"""
При  желании  можете  вытащить из  кармана поверженного врага бронзовый
свисток (- 214). И снова в путь - по тропинке, убегающей в лес - 437.""",
        "goto":[214,437]
        },
    627: {
        "text":"""
 Комната,  в  которую  вы попали, выглядит  достаточно  необычно.  Ровно
посередине к двери в противоположном конце комнаты протянулась узкая дорожка
пола.  Справа от  нее -  клумба  с  невиданными  доселе  красивыми  голубыми
цветами. Слева -  грядка,  на которой растут самые обычные на первый  взгляд
огурцы и  лук. Хотите  понюхать цветы  (142), сорвать лук  (471)  или огурец
(268) или предпочтете сразу выйти через противоположную дверь (80)?""",
        "goto":[142,471,268,80]
        },
    628: {
        "text":"""
 Если  вам  нечего противопоставить безмолвной страже, придется драться.
Капитан обезвредит любое ваше заклятие, так что можете даже и не пытаться их
использовать.
     ПЕРВЫЙ РЫЦАРЬ
     Ловкость 10 Сила 10
     ВТОРОЙ РЫЦАРЬ
     Ловкость 10 Сила 10
     Вам придется сражаться с ними одновременно.  А  через 6 раундов атаки к
ним присоединится еще и
     ТРЕТИЙ РЫЦАРЬ
     Ловкость 10 Сила 10
     Когда вы победите двух рыцарей, в дело вступит Капитан:
     КАПИТАН РЫЦАРЕЙ
     Ловкость 12 Сила 14
     Если  же  произойдет  чудо  и  вы  сможете  перебить   всю  охрану,  то
поднимитесь  по лестнице на небольшой  балкончик, куда выходят две двери.  И
выбирайте: войти в правую дверь (594) или в левую (599)?""",
        "goto":[594,599]
        },
    629: {
        "text":"""
Ничего  себе,  дружки подрались из-за добычи, а вам  теперь из-за этого
тратить драгоценную воду. Которая  и самому пригодится: кто  знает, что ждет
впереди. Дав  разбойнику понять, чтобы он поискал себе другого дурака, идете
дальше - 234.""",
        "goto":[234]
        },
    630: {
        "text":"""
Ваши глаза горят праведным гневом, а голос настолько уверен и напорист,
что Орки, почесав в затылках, пропускают вас - 48.""",
    "goto":[48]
        },
    631: {
        "text":"""
Подъемник благополучно  спускат вас. Перед вами небольшая дверь, через
которую выносят кушанья. Вы изо всех сил налегаете на нее - 76.""",
        "goto":[76]
        },
    632: {
        "text":"""
Сундук полон обрывками свитков. Это письма Принцессы к отцу, написанные
еще в ту пору, когда Барлад Дэрт надеялся, что девушка  согласится стать его
женой.  Он разрешил ей писать Королю, но ни одно послание не было отправлено
-  все  они  попали  в  этот  сундук  под  охрану  Призрака.  Но и  этим  не
удовлетворился  злой  маг  -  все  письма  разорваны,  а у  вас нет  времени
разгадывать  головоломки,  пытаясь  определить,  какой кусок свитка  откуда.
Бегло проглядывая  обрывки, выхватываете  из текста отдельные фразы, которые
хоть как-то можно  понять: "Меня охраняют Зеленые  рыцари", "...дешь ко мне,
захвати с собой  белую  стрелу", "...плохо и  страшно...",  "не присылай  на
верную смерть своих лю...", "...авная сила в волшебном перстне с рубином..."
Теперь,  если вы  еще  этого не сделали,  можете посмотреть  два  оставшихся
сундука:  большой  (474) или средний (540) или  же вернуться на  параграф  с
описанием большой залы (39).""",
        "goto":[474,540,39]
        },
    633: {
        "text":"""
 Вы  используете  заклятие  Левитации и  благополучно  перебираетесь  на
противоположный берег реки - 424.""",
        "goto":[424]
        },
    634: {
        "text":"""
"Еды-то у меня нет, - печально говорите вы, разводя руками, - но это не
значит, что я служу  Черному магу. Была  бы, с удовольствием бы  поделился".
Незнакомцы  недоверчиво смотрят на вас, как бы прикидывая, можно ли доверять
вашим словам. В конце концов они на что-то решаются. Проверьте ваше ОБАЯНИЕ.
Если все в порядке, то 387, если нет - 374.""",
        "goto":[387,374]
        },
    635: {
        "text":"""
Перстень с бриллиантом мгновенно открывает сложный замок - 130.""",
        "goto":[130]
        },
    636: {
        "text":"""
 Дерево падает  на вас раньше, чем вы успеваете  понять, что происходит.
Доверчивость  сослужила  вам  плохую  службу.  Вы забыли, что  лес  наводнен
шпионами  злого  волшебника,  и  попались на  удочку  одного  из  них.  Ваше
путешествие закончено...""",
        "goto":[1]
        },
    637: {
        "text":"""
У начала  узкой тропинки он пропускает вас  вперед.  Но  что это? Через
несколько  шагов  вы поскальзываетесь  и по пояс  проваливаетесь  в  вонючую
засасывающую жижу. Вы оборачиваетесь, чтобы позвать на помощь, но проводника
и след  простыл. Ведь он  на работе - и  маг  неплохо ее  оплачивает. Вам же
надеяться больше не на что...""",
        "goto":[1]
        },
    638: {
        "text":"""

     Бой окончен, но что делать у ворот цитадели с военнопленными? Вы можете
либо убить оставшихся  в живых  (473),  либо довести до ближайших деревьев и
привязать к ним их же ремнями. После чего войти в ворота - 100.""",
        "goto":[473,100]
        },
    639: {
        "text":"""
    Механизм прекрасно сконструирован, и тяжеленная плита поднимается, даже
не  скрипнув.  Тела  лежат в  беспорядке, в основном это скелеты. Между ними
виднеется  то,  что  опускали в  могилу  вместе  с погребенными  в  качестве
признаков рода занятий. Это подсвечник (+ 277), кнут (- 24), веревка (+ 172)
и копье. Если вы решили взять копье, то  402, если что-то из оставшегося, то
кладите вещи  в  заплечный  мешок  и решайте, через какую дверь лучше выйти:
через правую  (547)  или  левую  (501). Пронизывающее  воздух напряжение  не
позволяет задерживаться: все в вас стремится прочь от этого места.""",
        "goto":[277,24,172,402,547,501]
        },
    640: {
        "text":"""
Заклятия не  действуют  на  Духа  мертвых.  Иллюзией его не  удивишь  -
слишком много он повидал в туманном мире призраков; огнем не сожжешь - он не
более  чем  привидение.  Сила  его от  Кадашмана, повелителя Зла,  и не  вам
поражать его слабостью, а ваша сила если и возрастет, то и его увеличится на
столько же. Вам  придется драться с ним на мечах, причем у вас не будет даже
заклятия Копии - подобных ему не было и нет - 247.""",
    "goto":[247]
        },
    641: {
        "text":"""
Тянутся   долгие   минуты,  показавшиеся   часами:  стража  осматривает
несколько телег перед вами. Потом  острая  мгновенная боль. Недоверчивый Орк
ткнул мечом в  ваш  стог сена и лезвие прошло всего в нескольких сантиметрах
от сердца. По крови, которая закапала на дорогу, стража понимает все - и вам
никогда уже больше не увидеть солнца...""",
        "goto":[1]
        },
    642: {
        "text":"""
Вы выглядываете в окно, но не видите ни единого огонька - все поглощает
мрак ночи. Заклятие Левитации бесполезно: остальные окна,  если  они и есть,
закрыты. У  вас остается только один выход:  позвать  себе на помощь Пегаса,
если вы знаете, как это сделать. Если  же  нет, то недели через две или  три
Зеленые рыцари, регулярно  совершающие обход замка,  найдут вас,  но вряд ли
тогда удастся не только спасти Принцессу, но и спастись самому...""",
        "goto":[474,540,39]
        },
    643: {
        "text":"""
 За углом коридор кончается: тупик.  Вы быстро возвращаетесь обратно, но
дверь, которая только  что гостеприимно открылась, никак не  хочет выпускать
свою жертву. Это ловушка. Вы тщетно мечетесь  в поисках  выхода и никогда не
узнаете,  что  через потолок, который  чары мага  сделали полупрозрачным, за
вами  с радостью наблюдают несколько Орков.  Когда  вы умрете от голода, они
откроют дверь и заберут бездыханное тело...""",
        "goto":[1]
        },
    644: {
        "text":"""
Вы снова пробуете поднять крышку, и снова она падает на руку. Потеряйте
еще  1  ЛОВКОСТЬ и  2 СИЛЫ.  Сундук заколдован! - догадываетесь  вы. Что  же
теперь - обратите внимание на  средний сундук (540),  на маленький (380) или
же вернетесь на параграф с описанием большой залы (39)?""",
        "goto":[540,380,39]
        },
    645: {
        "text":"""
 Библиотекарь не понял вас, но вполне справедливо решил на всякий случай
поднять тревогу.  Вы не в силах сопротивляться вбежавшей  страже - Гоблинам,
вооруженным  боевыми  топорами.  Нескольких  вам  удается  убить,  но врагов
слишком много. Сильный  удар  по  голове (потеряйте  2 СИЛЫ)  - и вы теряете
сознание... - 409.""",
        "goto":[409]
        },
    646: {
        "text":""" 
    Дорога  приводит к покосившейся и  вросшей в  землю бревенчатой хижине.
Вокруг все тихо, и сколько вы не прислушиваетесь, не можете определить, есть
ли кто-нибудь внутри или  нет. Рискнете  войти  (221)  или  пройдете  мимо и
направитесь по тропинке в лес (55)?""",
        "goto":[221,55]
        },
    647: {
        "text":"""
 Вооруженный  мечом  Орк,  который расспрашивал вас, принимает  на  себя
первый удар (можете использовать заклятие Копии).
     ПЕРВЫЙ ОРК
     Ловкость 9 Сила 6
     Если  вы  убили  его  за  три  раунда  атаки,  то  сражайтесь  с  двумя
остальными. Если же нет, то  через три раунда они приходят на  помощь своему
предводителю, и вам придется биться с тремя сразу. После того как Первый орк
все же будет повержен, если хотите, ПРОВЕРЬТЕ СВОЮ УДАЧУ.  Если вы удачливы,
Третий орк не захочет умирать,  защищая  ворота, и убежит  в  лес.  У вас же
останется только один противник. Если же нет, то придется драться со всеми.
     ВТОРОЙ ОРК
     Ловкость 8 Сила 8
     ТРЕТИЙ ОРК
     Ловкость 7 Сила 8
     Если  вы еще  остались живы  после  битвы,  то  можете  проскользнуть в
ворота, оставив стражу лежать на дороге - 48.""",
        "goto":[48]
        },
    648: {
        "text":"""
 Одновременно с силой налегая на какую-то рукоять, торчащую рядом с  ним
из стены. Вы чувствуете, как пол уходит из-под ног. Река далеко внизу примет
ваш труп, но вы так и не узнаете, что за кольцо держали в руках...""",
        "goto":[1]
        },
    649: {
        "text":"""
 Библиотекарь  обманул вас, на самом деле решив на всякий случай поднять
тревогу.  Вы  не  в  силах   сопротивляться  вбежавшей  страже  -  Гоблинам,
вооруженным  боевыми  топорами.  Нескольких  вам удается  убить,  но  врагов
слишком много. Сильный удар  по голове (потеряйте 2 СИЛЫ)  -  и  вы  теряете
сознание... - 409.""",
        "goto":[409]
        },
    650: {
        "text":"""
Сосуд плотно закрыт пробкой, можете без опаски положить его в заплечный
мешок  (- 57). Что вы  сделаете дальше: возьмете стеклянный сосуд  (253) или
выйдете из комнаты (39)?
""",
    "goto":[57,253,39]
        },
    651: {
        "text":"""
Вы  накладываете заклятие, и в  воздухе появляется раскаленный огненный
шар.  Однако  у  Обезьяны  великолепная  реакция  -  в  одно  мгновение  она
оказывается  на  дереве  и  прячется  в  кроне.  Натали,  фея  лесных  грез,
покровительница лесов и лесных жителей, не даст вам устроить лесной  пожар -
шар гаснет, как только  касается первых  же  листьев. Через секунду Обезьяна
снова готова к бою,  и кажется, что она даже немного посмеивается над  вами.
Так или иначе зверь атакует, и воспользоваться другими заклятьями вы уже при
всем желании не успеете.
     ОБЕЗЬЯНА
     Ловкость 10 Сила 10
     Если вы победили ее, то 408.""",
        "goto":[408]
        },
    652: {
        "text":"""
Можете забрать  у него бронзовый свисток (- 214), который ему больше не
понадобится, и перейти реку - 118.""",
        "goto":[214,118]
        },
    633: {
        "text":"""
Дорога приводит  на прекрасный маленький луг посреди леса. Вы даже и не
думали, что здесь может встретиться такое красивое и спокойное место. Мягкая
трава так и манит прилечь и отдохнуть, тем более что вы сильно устали - 159.""",
        "goto":[159]
        },
    634: {
        "text":"""
Очевидно,  что Зеленый рыцарь либо вовсе не  имеет  права входить в эту
комнату (тогда вы проиграли), либо  должен вести себя по-хозяйски. "Привет",
- небрежно бросаете вы на  ходу, делая вид,  что торопитесь.  Улыбка на лице
женщины  гаснет,  однако  она  машинальным  движением отодвигает  в  сторону
тяжелую портьеру слева от вас. За ней оказывается дверь - 361.""",
        "goto":[361]
        },
    635: {
        "text":"""
Итак, путешествие подошло к концу. Миссия выполнена: Барлад Дэрт  погиб
от вашей руки, Принцесса  свободна. Узнав о  том, что их властелина более не
существует, Зеленые рыцари, Гоблины, Орки, слуги  и прочая нечисть торопятся
как  можно скорее покинуть замок:  они понимают, что  этому  творению черной
магии скоро придет конец. Коридоры замка быстро пустеют, и вы в безопасности
выводите Принцессу  наружу. Ворота распахнуты, стража оставила их. И вот уже
страшная и угрюмая цитадель позади. Из-за леса показалось восходящее солнце,
и  с  его  первыми  лучами  Черный замок  рушится,  как  карточный  домик, и
проваливается в разверзшуюся землю. Лес светлеет, и  вы понимаете,  что злые
чары  покинули  его. Теперь дорога  займет  немного времени, и вскоре вы уже
будете  во  дворце.   После  этого  вы  сможете  покинуть  Элгариол  и   его
гостеприимную  столицу, но у  вас всегда будет  возможность  вернуться  туда
вновь, чтобы стать героем совсем другой истории..."""
    }
}
