
d = {
	351:{
	"text":"""Крестьянин внимательно  смотрит на вас и говорит, что может проводить к
человеку,   который  вам   нужен.  Через  несколько  домов  живет  торговец,
поставляющий в Черный замок  сено для  лошадей волшебника.  Тот за небольшую
плату  (3 золотых)  соглашается спрятать вас на  одном из возов под сеном  и
доставить в замок. Примете  его предложение  (574) или откажетесь и покинете
деревню по одной из дорог: на юг (235) или на запад (2).""",
	"goto":[574, 235, 2]
	},
	
	352:{
	"text":"""Держась за стену, доходите до двери.  За ней лестница, но она освещена,
и приходится несколько минут постоять, пока глаза  привыкнут  к свету. Затем
вы поднимаетесь по  лестнице, но ни через два, ни через три, ни через четыре
пролета не встречаете выхода с нее.  Наконец перед  вами последний пролет, в
начале его дверь,  но как вы ни стараетесь, открыть ее не удается.  Придется
подниматься до конца - 322.""",
	"goto":[322]
	},

	353:{
	"text":"""Ранним  утром  вы  выходите  на  перекресток.  От  дороги  отходят  две
тропинки. Свернете направо (154), налево (237) или пойдете по дороге прямо и
посмотрите, куда она вас приведет (181)?""",
	"goto":[154, 237, 181]
	},

	354:{
	"text":"""Он  с  удивлением  смотрит  на  протянутую  стрелу  и  говорит, что  не
понимает,  зачем бы она могла ему  пригодиться.  Так что вам  придется  либо
платить деньги (42), либо драться с ним (518), либо уходить (106).""",
	"goto":[42, 106],
	"fight":[518]
	},

	355:{
	"text":"""Что, по-вашему, может послужить пропуском?
     Золотое кольцо?
     Бронзовый свисток?
     Четки?
     Если у вас нет ни одного из этих предметов, вам придется драться - 543.""",
	"fight":[542]
	},

	356:{
	"text":"""Вы без предупреждения нападаете на Тролля.
     ТРОЛЛЬ
     Ловкость 9 Сила 14
     Хозяин винного погреба без труда развеет ваши заклятия, поэтому драться
с ним  придется, надеясь  только на  себя  и  на свой  меч. Если вы победили
Тролля, то обнаруживаете в одном из его карманов Золотое кольцо (+ 214). Как
оно попало  сюда и для чего служит, вам неведомо. Кроме того, можете бросить
кубик и  почистить соответствующий  квадрат  УДАЧИ. А  теперь  уходите через
дверь в противоположном конце прохода между полками - 207.""",
	"goto":[207]
	},

	356:{
	"text":"""Вы без предупреждения нападаете на Тролля.
     ТРОЛЛЬ
     Ловкость 9 Сила 14
     Хозяин винного погреба без труда развеет ваши заклятия, поэтому драться
с ним  придется, надеясь  только на  себя  и  на свой  меч. Если вы победили
Тролля, то обнаруживаете в одном из его карманов Золотое кольцо (+ 214). Как
оно попало  сюда и для чего служит, вам неведомо. Кроме того, можете бросить
кубик и  почистить соответствующий  квадрат  УДАЧИ. А  теперь  уходите через
дверь в противоположном конце прохода между полками - 207.""",
	"goto":[207]
	},

	357:{
	"text":"""Заклятие  действует,  и вы можете прибавлять  на  время  этого  боя две
единицы к своей Ловкости - 316.""",
	"goto":[316]
	},

	358:{
	"text":"""Ночь  проходит  спокойно  (можете  восстановить  2 СИЛЫ).  Но  когда вы
просыпаетесь, выясняется, что лес спрятал  дорогу, по которой вы шли. Вместо
этого перед вами  широкий перекресток и три дороги: направо, налево и прямо.
Куда вы пойдете: направо (510), налево (214) или прямо (38)?""",
	"goto":[510, 214, 38]
	},

	359:{
	"text":""" Как  ни странно, но эти рыбы действительно питаются  людьми. И где  они
только их берут, живя в  этом далеком, забытом озере? Может быть, им хватает
таких путешественников, как вы?..""",
	"goto":[1]
	},

	360:{
	"text":""" Через некоторое время видите еще одну дорогу.  Теперь уже вам  придется
либо пойти  по ней (2), либо  все-таки передумать и войти в  деревню (580) -
дальше  начинается бурелом,  продираться  через  который  нет  ни  малейшего
желания.""",
	"goto":[2, 580]
	},

	361:{
	"text":"""Вы входите  в  комнату и видите перед собой... четырех Зеленых рыцарей.
Они несколько секунд удивленно смотрят на вас,  не вставая со своих глубоких
деревянных кресел. Потом  один из них кивает другому, и  тот  поворачивается
вместе с креслом вокруг оси.  Еще не успев сообразить,  зачем он это делает,
чувствуете,  как пол вместе с вами описывает полукруг, теряете  равновесие и
летите в бездну. Вы так и не узнаете, были ли близки к цели или нет...""",
	"goto":[1]
	},

	362:{
	"text":"""Вы прикладываете к  углублению в двери  медальон с золотым орлом,  и он
словно прилипает к ней.  По крайней мере взять его  обратно  уже не удается.
Дверь  медленно раскрывается - впереди узкий коридор. Он прекрасно  освещен,
стены украшены дубовыми панелями с изображением  гербов Катэны. Любопытно, с
чего это  вдруг Барлад Дэрт  так  чтит этот город? В  конце  концов  коридор
упирается в дверь. Она не заперта - 241.""",
	"goto":[241]
	},

	363:{
	"text":"""Вы склоняетесь к  родничку и делаете несколько глотков. Вода прохладная
и вкусная.  Напившись,  вы чувствуете себя  освеженным и отдохнувшим (можете
восстановить  2  СИЛЫ).  Теперь,  если  хотите,  наполните  флягу  (307) или
отправляйтесь дальше (161).""",
	"goto":[307, 161]
	},

	364:{
	"text":"""Только меч Зеленого рыцаря может сразить Каменных крыс. Увидев его, они
в  ужасе  разбегаются.  Ваш  путь  свободен.  Дверь справа от  вас  ведет  в
следующую комнату - 480.""",
	"goto":[480]
	},

	365:{
	"text":"""Какое бы заклятие  вы  ни наложили,  Барон без  труда нейтрализует его.
Вычеркните  выбранное вами заклятие,  вернитесь на 543 и надейтесь только на
свой клинок.""",
	"goto":[543]
	},

	366:{
	"text":"""Вы стоите на другом берегу  реки. Теперь цитадель высится слева от вас.
Можно обойти ее вокруг и поискать  вход  (416). Но прямо  перед вами  в углу
двора  виднеется  заброшенный  домик. До него еще слишком  далеко  и  нельзя
предположить,  кто его  обитатели.  Если  хотите, сначала подойдите  к  нему
(116).""",
	"goto":[116]
	},

	367:{
	"text":"""Ваш выбор падает на шкуру лисы (+ 17). Трудно сказать, зачем она  может
пригодиться, но - чего  не бывает. Теперь  пора выбираться из берлоги. Новая
дорога уводит вас в глубь леса - 44.""",
	"goto":[44]
	},

	368:{
	"text":"""Выбрав  правый коридор, вы успеваете  сделать  по  нему всего несколько
шагов, когда за спиной падает тяжелая железная решетка. Вы в западне. Найдут
вас теперь не скоро, но и тогда пощады ждать не приходится...""",
	"goto":[1]
	},

	369:{
	"text":"""Старуха подбирает монеты, кланяется и услужливо открывает правую дверь,
после чего исчезает. Пойдете в эту дверь (542) или в ту, что прямо (252)?""",
	"goto":[542, 252]
	},

	370:{
	"text":"""Заклятие  Иллюзии  не действует на  стариков. Хотите наложить  заклятие
Огня (538) или наберетесь терпения (68)?""",
	"goto":[538, 68]
	},

	371:{
	"text":"""Бесполезно: старик даже не замечает,  что вы на него напали. Колдовство
слишком сильно, чтобы вы могли  бороться с ним. Придется покорно идти дальше
- 276.""",
	"goto":[276]
	},

	372:{
	"text":"""Вы идете по дороге всю ночь. Поначалу клубочек еще виден в слабом свете
нарождающейся  луны.  Однако  в  темноте   приходится   миновать   несколько
перекрестков, и  вам  не  удается  уловить  момент, когда  подарок Лесовичка
исчезает в ночи. Искать его во тьме бесполезно, и вы не рискуете сворачивать
с  избранного  пути.  Начинает  сказываться   усталость,   глаза   слипаются
(потеряйте 3 СИЛЫ).  Когда из-за деревьев робко  встает  солнце,  становится
видно, что конец дороги близок - 181.""",
	"goto":[181]
	},

	373:{
	"text":"""Свисток нравится торговцу, но он не знает, что с ним  делать,  и просит
сверх того дать ему еще 2 золотых. Вы можете либо согласиться с предложением
и  отдать деньги  и  свисток (443), либо отказаться и  уйти, забрав  свисток
обратно (106).""",
	"goto":[443]
	},

	374:{
	"text":"""Они атакуют вас одновременно.
     ПЕРВЫЙ ЧЕЛОВЕК
     Ловкость 8 Сила 8
     ВТОРОЙ ЧЕЛОВЕК
     Ловкость 6 Сила 12
     Если вам удалось победить их, то 34.""",
	"goto":[34]
	},

	375:{
	"text":"""Вы подходите к реке, но вброд ее не перейти. Вам придется  использовать
заклятия: либо Плавания  (254),  либо Левитации  (508). Если хотите, можете,
используя заклятие Плавания, попробовать проплыть по течению реки под замок,
надеясь попасть в подземелье незамеченным (596). Если же у вас нет ни одного
из этих заклятий или вы не хотите их использовать, идите к палаткам - 424.""",
	"goto":[254, 508, 596, 424]
	}, 

	376:{
	"text":"""Вы платите 2 золотых, и он подплывает к вам с красивой глиняной пиалой,
наполненной водой. Она чистая и прохладная, и  вы с удовольствием пьете,  но
вдруг  чувствуете,  что  настолько  хотите  спать,  что  не  в  силах  этому
сопротивляться. Засыпая, медленно опускаетесь на пол таверны - 155.""",
	"goto":[155]
	}, 

	377:{
	"text":"""Дорога  понемногу  меняет  направление  и  ведет  к середине  леса.  Вы
радуетесь, что не свернули  на тропинку: по дороге-то идти гораздо быстрее и
удобнее.  Но  вдруг за поворотом  слышится  приближающийся топот копыт. Черт
возьми,  кажется,  удобным  путем  решили  воспользоваться  не  только   вы!
Спрячетесь  и посмотрите,  кто  едет  вам  навстречу (197),  или предпочтете
остаться и понаблюдать за всадником (309)?""",
	"goto":[197, 309]
	}, 

	378:{
	"text":"""Вскоре вы  выходите  на  мост,  под  которым проходит  еще одна дорога.
Спуска  вниз нет, так  что можно либо попытаться  спрыгнуть (415), либо идти
дальше (129).""",
	"goto":[415, 129]
	},

	379:{
	"text":"""За дверью - коридор, в конце его  еще одна дверь, на  этот  раз гораздо
ниже.  Она  заперта, но вам без особого труда удается почти что  бесшумно ее
выломать. Узкая винтовая  лестница  ведет  вниз,  в подземелье замка.  Через
несколько  пролетов снова  дверь, которую  открыть  уже не  удается никакими
силами. Приходится спускаться до конца - 544.""",
	"goto":[544]
	}, 

	380:{
	"text":"""Маленький сундук заперт,  однако мечом вы ухитряетесь кое-как подцепить
скобы замка. Но сможете ли вы их вырвать? Киньте кубик два раза, прибавьте к
сумме  выпавших  на  нем чисел  10 и  сравните полученный результат  с вашей
СИЛОЙ. Если он меньше ее, то 632, если же больше или равен - 103.""",
	"goto":[632, 103]
	},

	381:{
	"text":"""Вы побеждаете, и скелет скрывается под  своим надгробием. Теперь  можно
перевести дух  и  оглядеться. Перед вами два саркофага  и могильная плита  в
дальнем углу огромного подземного зала.  Один из саркофагов  украшен  конной
статуей человека в  длинной мантии и с короной  на голове.  В правой  руке у
него  меч, другой  он держит  поводья  лошади. На  втором  саркофаге высечен
крест, иных знаков и украшений на нем нет. Несмотря  на то, что Дух  мертвых
сгинул, воздух подземелья не располагает к долгим и неторопливым поискам. Вы
чувствуете,  что каждая  лишняя  минута, проведенная здесь, таит смертельную
опасность. Направитесь  к саркофагу  со статуей (84), к саркофагу  с крестом
(281), к могиле (496)  или уйдете через одну  из  двух дверей в левой стене:
правую (547) или левую (501)?""",
	"goto":[84, 281, 496, 547, 501]
	},

	382:{
	"text":"""Вы даете женщинам 4 золотых.  Они довольны вашей щедростью и предлагают
вывести вас с этажа незамеченным. Если вы  согласны на это,  то  скажите им,
хотите ли пойти наверх (575) или вниз (511), иначе же можете просто выйти из
гарема и идти дальше по коридору (251).""",
	"goto":[575, 511, 251]
	},

	383:{
	"text":"""Клубочек сворачивает на тропинку, ведущую направо (576). Пойдете за ним
или предпочтете вернуться на 353 и выбрать дорогу самостоятельно?""",
	"goto":[576, 353]
	},

	384:{
	"text":"""Вы вставляете  фигурный ключ  в  замочную  скважину.  Раздается  легкий
щелчок. Крышка  сундука откидывается -  на самом дне виден небольшой футляр.
Достав и открыв его, обнаруживаете золотое ожерелье (+ 152). Если у вас есть
лишнее место, можете взять его с собой. Что  же  дальше? Попробуете  открыть
большой  сундук  (474),  маленький  (380)  или  уйдете  от  греха  подальше,
вернувшись на параграф с описанием большой залы (39)?""",
	"goto":[474, 380, 39]
	},

	385:{
	"text":"""Вы  подходите  к  столикам.  На  их  крышках  выгравировано  двенадцать
рисунков, каждый из которых соответствует одному из  месяцев. Самый красивый
- рисунок Месяца туманов, но... Насладиться ими вам не дают - 502.""",
	"goto":[502]
	},

	386:{
	"text":"""Вы подходите  к нему и видите, что это конюшня.  Дверь полуоткрыта - ну
как не заглянуть внутрь. Никого из конюхов нет,  но из стойла смотрит на вас
грустными глазами  черный крылатый конь - Пегас.  Увидев его, вспоминаете  о
волшебных животных, на которых прилетали во дворец послы коварного мага. Это
наверняка одно из них.  Войдете в  конюшню (548) или подумаете,  что в любую
минуту могут вернуться конюхи, и направитесь к центральному зданию (416)?""",
	"goto":[548, 416]
	},

	387:{
	"text":"""Поверив,  что  у вас  и  в  самом деле нет  дурных  мыслей,  незнакомцы
успокаиваются. И в знак  доверия  рассказывают, что некогда жили в деревушке
на краю леса.  Может быть, вы были в ней? (Если да, почему бы  не рассказать
им, что стало с деревней). Когда Черный маг захватил  лес, почти все мужчины
были на охоте и ни о чем не ведали. По одному многих из них переловили воины
волшебника  и  заставили работать на полях неподалеку от замка. Но несколько
недель назад им двоим удалось бежать, и  с тех пор приходилось питаться тем,
что дарил лес. Беглецы просят прощения  за то,  что чуть  было не  напали на
вас, и беспрекословно пропускают дальше - 3.""",
	"goto":[3]
	},

	388:{
	"text":"""Барлад Дэрт вновь смотрит  на вас. На этот раз в его взгляде уже больше
любопытства. "Забавно,  - говорит он, - сколько же человечек может возомнить
о себе. Наверно, думаешь,  что ты - вершитель судеб  королевства, а я сейчас
помогу тебе разбудить  Принцессу, и  мои кони доставят  вас  обоих домой? На
самом деле  ты только мое развлечение, забава и не более того. Я наблюдал за
тобой  с  того момента, как ты  вошел в  лес". Видя, что вы  не  верите, маг
напоминает  несколько  наиболее  опасных  моментов  вашего  путешествия.  "А
теперь, - продолжает  он, - мне просто любопытно,  что ты собираешься делать
дальше. И вообще, я не понимаю, чем тебе не понравился мой новый камердинер,
- он  кивает на Гарпию. - Я просто хотел, чтобы она почистила твою одежду  -
уж  слишком она пыльная". Чародей издевается над вами,  но вы-то  не ожидали
такой встречи, надеясь, что, когда доберетесь  до его кабинета,  все решится
само собой.  Что же  делать теперь? Если хотите, то  можете выхватить меч  и
попробовать убить мага (577), а может быть, у вас  есть золотое  кольцо  или
золотой амулет? Тогда воспользуйтесь ими. Иначе вам придется просто стоять и
смотреть, что будет дальше - 483.""",
	"goto":[577, 483]
	},

	389:{
	"text":"""Вы выпиваете жидкость. Это Микстура ужаса. Каждый раз,  когда вы будете
встречаться с врагом, вам потребуются все силы, чтобы подавить  в  себе ужас
перед ним, поэтому потеряйте 1 ЛОВКОСТЬ. Пока вы возитесь с микстурой, дверь
сама собой закрывается, и отпереть ее вновь уже не удается - 300.""",
	"goto":[300]
	},

	390:{
	"text":"""Тропинка не сулит ничего  особенно хорошего: понемногу почва под ногами
становится   подозрительно  мягкой.  Осознав,  что  вряд  ли  двигаетесь   в
правильном направлении, поворачиваете назад с надеждой выбраться из западни.
Но не тут-то было.  Под ногами  едва  ли не самое опасное, что  только может
встретиться неопытному  путешественнику  -  гибельная  засасывающая топь. Из
последних сил вы боретесь с ней, но все напрасно. Через четверть часа от вас
не остается и следа, а фальшивая тропинка  все так же продолжает  заманивать
доверчивых путников...""",
	"goto":[1]
	},

	391:{
	"text":"""Счастье изменило вам. Вы укололись настолько больно, что оказались не в
силах сдержать крик - 502.""",
	"goto":[502]
	}, 

	392:{
	"text":"""Рыцарь, обрадованный  тем,  что  вы  не открыли  крышку,  действительно
пропускает  вас мимо себя. Но одновременно он с силой  налегает на  какую-то
рукоять,  торчащую рядом с  ним из стены.  Вы наказаны за свою доверчивость:
пол  уходит  из-под ног, и вы  чувствуете, что летите в  бездну.  Так  и  не
выполнив свою миссию...""",
	"goto":[1]
	},

	393:{
	"text":"""Дверь заперта. Есть ли у вас медный ключик? Если да, то можете  достать
его и попытаться отпереть дверь, если же нет,  то  попробуйте открыть или ту
дверь, что за вами (337), или ту, что слева от вас (595).
""",
	"goto":[337, 595]
	}, 

	394:{
	"text":"""Что вы хотите  ей подарить? Бронзовый  свисток, зеркальце или флакончик
духов? Если ни одной из этих вещиц у вас нет, придется с ней сразиться - 93.""",
	"goto":[93]
	},

	395:{
	"text":"""Вы накладываете заклятие Ловкости, и сила Зеленого  рыцаря  возрастает.
Он  обратил ваше заклятие на себя,  и  теперь  придется прибавлять  2  к его
Ловкости - 567.""",
	"goto":[567]
	},

	396:{
	"text":"""Вы угадали,  в последнее время волшебник действительно частенько играет
в карты. Подозрительно оглядев с ног до  головы, стража пропускает вас через
ворота - 100.""",
	"goto":[100]
	},

	397:{
	"text":"""Вы оказываетесь в комнате Начальника стражи. Гордый  и важный Гоблин, в
расшитом золотыми  галунами плаще,  на  котором  вышиты  буквы  "Б"  и  "Д",
привстает вам навстречу из-за  стола. Но вы не знаете, как должен вести себя
Зеленый  рыцарь,  попав  в  эту  комнату!  Пройти,  кивнув? Или  поговорить,
придумав  какое-нибудь  поручение?  В комнате еще две  двери -  одна  за его
спиной,  одна в стене справа. Выйдете в правую дверь (512), в ту, что  перед
вами (39), или попробуете с ним поговорить (315)?""",
	"goto":[512, 39, 315]
	}, 

	398:{
	"text":"""Открыв дверь, попадаете в маленькую проходную комнатку. Она пуста, и из
нее ведет только один путь - вперед - 39.""",
	"goto":[39]
	},

	399:{
	"text":"""Открыв дверь, попадаете в просторную комнату,  назначение которой сразу
же  становится понятно.  Это  гарем волшебника.  Жены  чародея  с удивлением
смотрят на вас, явно ожидая объяснений столь бесцеремонного вторжения. Всего
несколько  секунд вы можете  потратить  на  то,  чтобы  оглядеться.  Ковры и
зеркала,  удобные мягкие диваны, картины в золотых рамах - это самая богатая
комната из всех, что вы встречали. Скорее всего Барлад Дэрт редко выходит из
своего кабинета (да  где же  он все-таки - наверху или  внизу?!), поэтому  в
других  комнатах только самое необходимое. Но здесь  он, несомненно,  бывает
часто. В  гостиной есть еще  одна дверь  в противоположной стене. Решайтесь:
пройдете в нее, ничего не  сказав женщинам и надеясь, что они вскоре забудут
о вашем появлении (198), или  попытаетесь поговорить с ними (255): вдруг они
увидят в вас своего спасителя и помогут вам.""",
	"goto":[198, 255]
	},   

	400:{
	"text":"""Она  с презрением ломает перо и  отбрасывает его в сторону. Что теперь?
Дадите ей денег (137) или будете драться (522)?""",
	"goto":[137, 522]
	}            
   
}
