d={
    251:{"text":
         """После нескольких поворотов коридор заканчивается тупиком.
         Но теперь перед вами две двери: направо (162) и налево (76).""",
         "goto":
         [162,76]},
    252:{"text":"""Как только закрылась дверь, из угла комнаты на вас бросаются Крысы.
         Вы с ужасом замечаете, что они не обыкновенные, а каменные.
         Если хотите, можете показать им пропуск, надеясь, что это поможет, или же можете воспользоваться заклятиями Слабости (564) или Огня (541).
         Хотите, вынимайте меч и сражайтесь с ними (494).
         Если же у вас есть меч Зеленого рыцаря,то разумнее было бы использовать именно его.""","goto":
         [564,541,494]},
    253:{"text":"""Вы берете стеклянный сосуд. Киньте кубик два раза.
         Если сумма выпавших на нем чисел больше или равна вашей ЛОВКОСТИ,
         то 58. Если меньше - 182.""",
         "goto":[58,182]},
    254:{"text":"Вы используете заклятие и переплываете через реку - 366.",
         "goto":[366]},
    255:{"text":"""Заговорив с ними, выясняете, что, как ни странно, женщины вполне довольны своей жизнью, и их ничего не интересует, кроме денег.
          На шум голосов из соседней комнаты выходит хозяйка гарема.
          Можете попробовать найти с ней общий язык, подарив ей какой-нибудь подарок (551), или дать деньги женам мага. Но сколько: 1 золотой (79), 4 золотых (382) или 6 золотых (495)? Хотите,попробуйте извиниться за вторжение и пройти через комнату к двери (198).""",
         "goto":[551,79,382,495,198]},
    256:{"text":"""Вы накладываете заклятие Слабости и, так и не узнав, подействовало оно или нет, начинаете бой - 316""",
         "goto":[316]},
    257:{"text":"""Вы стучите молотком по двери. Она неохотно со скрипом открывается, и перед вами предстает привратник - огромный лев, закованный в доспехи. Если вы знаете условную фразу для входа в замок, то 565, если же нет, придется пробиваться с помощью своего меча.
         ЛЕВ
         Ловкость 9 Сила 14
         Убив стража, можете перешагнуть через него и войти - 265""",
         "goto":[565,265]},
    258:{"text":"""Перстень с изумрудом нет смысла класть в заплечный мешок, и вы надеваете его на палец (+ 169). К сожалению, снять с руки мага второй перстень вам уже не удается. Что вы осмотрите теперь: шкаф (560), зеркало (165) или стол (288)?""",
         "goto":[560,165,288]},
    259:{"text":""" Стража недоверчиво смотрит, но, судя по всему, вы угадали, и вас впускают внутрь - 48.""",
         "goto":[48]},
    260:{"text":"""Это как раз то, что надо. Вы прекрасно помните слова старичка: нажимаете на третий камень слева от дверной ручки, и слышится глухой щелчок. Путь открыт, и вы быстро проскальзываете во двор замка. В центре двора высится большое здание, но уже темно, и разглядеть его очень трудно. Слева из-под угловой башенки вытекает река и скрывается под зданием. Справа - невысокое маленькое строение, которого отсюда почти не видно.
         Пойдете к нему (116), к реке (4) или к зданию в центре двора (416)?""",
         "goto":[116,4,416]},
    261:{"text":"""Дракон решает, что вы предлагаете ему причесаться
         (в самом деле, что ему делать с гребнем?),
          и возмущенно выпускает небольшую струю пламени в вашу сторону.
          Потеряйте 2 СИЛЫ и сражайтесь, теперь уже другого выхода нет - 316.""",
         "goto":[316]},
    262:{"text":"""Что ж, товар неплох", - говорит один из стражников, пропуская вас, - 100.""",
         "goto":[100]},
    263:{"text":"""Вы вспоминаете про серебряный сосуд, в который так и не заглянули.
          Быстро достаете его из заплечного мешка и готовитесь открыть.
          Однако Зеленый рыцарь умоляет этого не делать, разрешая пройти.
          Откроете крышку, несмотря на его уговоры (590) или достаточно того, что вы как следует напугалстража и теперь можете идти дальше (392)?""",
         "goto":[590,392]},
    264:{"text":"""
          Ну что ж, деритесь.
          ГИЕНА
          Ловкость 8 Сила 6
          Если вы убили ее, можете двигаться дальше - 117.""",
         "goto":[117]},
    265:{"text":""" Осторожно входите в гулкий Главный коридор Черного замка. В этот момент какой-то странный звук привлекает внимание. Нервы напряжены, и вы резко оборачиваетесь: дверь за спиной захлопывается. Через несколько секунд это уже не дверь, а часть стены, и даже нельзя сказать, где она была. Пытаетесь открыть ее - слишком поздно. Может быть, когда-нибудь вы узнаете, почему все двери в замке будут закрываться за вашей спиной (так, что их при этом будет не открыть ни силой, ни ключами), но пока есть только один путь - вперед. Через каждые несколько шагов на стенах висят канделябры в виде извивающихся змей - света достаточно. Но потолка не видно, он уходит куда-то вверх, в загадочную темноту, где царит эхо, сопровождающее каждый ваш шаг. Из коридора ведут две двери и две лестницы. Лестница справа уходит вниз, слева - наверх. В конце Главного коридора две двери - тоже направо и налево, но они совершенно одинаковые, и ничто не подсказывает вам, какую из них выбрать. Решайте, куда пойдете.
          По лестнице вверх (191) или вниз (30), в дверь направо (53) или налево (467)?""",
         "goto":[191,30,53,467]},
    266:{"text":"""  Вы подходите к зеркалу и поворачиваете его, открывая проход на лестницу. Когда вы выходите на нее, дверь бесшумно закрывается: назад пути уже нет. Выход только один: сразиться с волшебником и победить его. Лестница идет вверх на много этажей. В конце - дверь. Вы толкаете ее, и она отходит в сторону вместе с зеркалом с другой стороны.
          Вы же переступаете порог - 553.""",
         "goto":[553]},
    267:{"text":""" Вы достаете перо павлина.
          Стоит павлину посмотреть в вашу сторону, как перо начинает ярко светиться.
          Теперь вы овладели секретом и сможете зажигать перо, когда захотите (+ 16).
          Мысленно поблагодарив павлина,
          переходите к следующей решетке - 147.""",
         "goto":[147]},
    268:{"text":"""Срываете огурец и пробуете.
         Вкус у него самый обычный, и вы без опаски съедаете овощ целиком.
         Можете восстановить 2 СИЛЫ и поскорее уходите, пока не появился разъяренный садовник - 80.""",
        "goto":[80]},
    269:{"text":"""Вы идете в полной темноте.
         Где-то наверху шумит река, но ход идет дальше и заканчивается винтовой лестницей, в конце которой дверь.
         Вы открываете ее и... - 265.""",
        "goto":[265]},
    270:{"text":"""Вы предлагаете нищенке серебряный браслет, который она с радостью надевает на свою костлявую руку. Перед тем как растаять в воздухе, она показывает на дверь, ведущую из комнаты направо. Послушаетесь совета и войдете в нее (542) или же выберете дверь в противоположной от входа стене (252)?""",
         "goto":[542,252]},
    271:{"text": """"В кости", - отвечаете вы, но Орки даже не знают такой игры. Вы понимаете, что ответ неудачен, и решаете пробиться в замок силой - 341.""",
         "goto":[341]},
    272:{"text":"""Машинально показываете крысам пропуск, не надеясь, что это поможет.
          Но, как ни странно, пропуск действует на животных успокаивающе, и они, повизгивая, уползают в угол.
          Можете еще раз похвалить себя за отсутствие жадности и обилие предусмотрительности и выйти из комнаты через дверь справа - 480.""",
         "goto":[480]},
    273:{"text":"""Вы накладываете заклятие Левитации и вылетаете в окно. Снаружи замок очень красив. Окон почти не видно, но над "своим" окном вы замечаете еще два - одно над другим. Вернетесь обратно в то окно, из которого вылетели (111), попробуете влететь в окно повыше (78) или пониже (566)?""",
         "goto":[111,78,566]},
    274:{"text":"""Старуха подбирает монеты, кланяется, после чего делает знак следовать за ней. Она открывает правую дверь и тает в воздухе. Но когда вы делаете шаг в сторону от двери, она снова возникает и снова настойчиво указывает на дверь справа.
          Повинуетесь ее настояниям и войдете (542) или попробуете отогнать старуху мечом (522)?""",
        "goto":[542,522]},
    275:{"text":"""Вы приближаетесь к ложу и склоняетесь над Принцессой. Если у вас есть волшебный перстень или золотой апельсин, то вы знаете, что надо делать. Если же нет, то разбудить Принцессу не удастся, и вы можете либо подойти к зеркалу (279), либо к столикам, на которых горят свечи (385).""",
         "goto":[279,385]},
    276:{"text":"""Старик открывает потайную дверцу в стене.
          За ней комната, в которой в изобилии представлены разнообразные орудия пыток.
          И огромный Орк, который, собственно, и принимается за дело.
          Как вы ни пытаетесь вырваться из его рук, это не удается.
          Не спасет и волшебство - старик поможет Орку развеять любое заклятие, которое вы будете в силах наложить. Конечно, вы не поддадитесь пыткам и не выдадите себя. Но ваше путешествие закончено, до казни на рассвете остается всего несколько часов...""",
          "goto":[1]},
    277:{"text":""" Вы входите в комнату, и дверь закрывается.
          В ту же секунду комната погружается во тьму.
          Но это не просто темнота - она живет, дышит, чьи-то руки трогают вас, чье-то дыхание едва уловимым ветерком касается лица, воздух вокруг колеблется. Вы осторожно проводите рукой по стене, пытаясь нащупать выход. Через несколько мгновений слышится Голос. Вам кажется, что он идет отовсюду: и справа, и слева, и даже из-под ног. "Никто не может безнаказанно нарушить покой Духов тьмы!" В углу комнаты появляется слабый свет, но его достаточно, чтобы разглядеть человеческий скелет, лежащий вдоль стены. Невидимая рука, держащая свечу, движется: вот еще один скелет, он уже сидит, прислонившись к той же стене, вот еще один, еще. А это уже не скелет, человек погиб совсем недавно, и вы с ужасом узнаете в нем одного из пажей, которых видели в королевских покоях. Видимо, вы путешествуете слишком долго, и паж был следующим, кто вызвался освободить Принцессу. По лесу он наверняка прошел быстрее - и вот такая смерть... Может быть, поможет какая-нибудь вещица из вашего заплечного мешка? Что вы достанете? Подсвечник? Перо павлина, если вы толком умеете с ним обращаться? Серебряный сосуд? Золотое ожерелье?
          Зажжете свечу или светильник?
          Если же у вас нет ни одного из этих предметов, то 572.""",
         "goto":[572]},
    278:{"text":"""Вероятно, вопрос был не самым удачным, потому что один из Орков, невозмутимо глядя вам прямо в глаза, дергает какой-то рычаг под столом, и вы проваливаетесь вниз. Последнее, что почувствовали: тупую боль в голове от сильного удара (потеряйте 4 СИЛЫ) - и сознание покидает вас... - 409.""",
         "goto":[409]},
    279:{"text":"""Вы подходите к зеркалу, но не замечаете ничего необычного. Его обрамляет золотая рама с изображениями сцен из жизни гарпий. Но как следует насладиться прекрасным орнаментом вам не дают - 502.""",
         "goto":[502]},
    280:{"text":"""Вы решаете использовать заклятие Иллюзии.
          Гоблинам начинает казаться, что в клетке томитесь не вы, а сам черный маг.
          Они в ужасе отпирают ее и выражают готовность подчиняться любым вашим приказам.
          Что бы такого приказать? Ничего особенно оригинального на ум не приходит, ну да ладно: пусть сами зайдут в клетку. А вы их там и запрете. После этого вы подходите к столу и собираете все свои вещи в заплечный мешок. Теперь можете либо осмотреть ларь в углу (318), либо сразу уйти (193).""",
         "goto":[318,193]},
    281:{"text":""" Перед вами саркофаг монаха. Все его богатство - четки (- 187), и они лежат прямо на надгробии. Вы можете взять их с собой. Пронизывающее воздух напряжение не позволяет задерживаться: все в вас стремится прочь от этого места. Остается только выбрать, через какую дверь уходить: правую (547) или левую (501).""",
         "goto":[547,501]},
    282:{"text":"""Средняя дверь открывается в короткий коридор, который раздваивается. Вы пойдете в правый проход (368) или в левый (536)?""",
         "goto":[368,536]},
    283:{"text":"""  Что вы покажете рыцарю как пропуск?
          Зеркальце?
          Бронзовый свиток?
          Золотое кольцо?
          Если у вас нет ни одного из этих предметов, то путь вперед придется прокладывать мечом - 567.""",
         "goto":{567}},
    284:{"text":"""Вы говорите, что в Черном замке заточена Принцесса и вы решили ее освободить. Но не слишком ли опрометчив ваш ответ? - 555""",
         "goto":[555]},
    285:{"text":"""Открываете дверь и делаете несколько шагов вперед. В этот момент вы замечаете, что попали далеко не в самое обычное помещение. Это Подземелье мертвых. Бог весть откуда взялось оно в этом замке, лишь недавно возведенном злыми чарами Барлада Дэрта. Но самое страшное то, что вы стоите прямо на надгробии. На нем едва заметными от времени буквами написано: "Кто потревожит мой сон, навсегда упокоится рядом со мной". Холодок пробегает по спине. А вдруг и правда... Но что это? Надгробие откидывается, отбрасывая вас назад, и из него поднимается высокий скелет в рыцарских латах. Вы цепенеете от ужаса, а он движется прямо на вас, улыбаясь пустым темным оскалом рта - 321.""",
         "goto":[321]},
    286:{"text":"""
          Лишь только ступили на левую дорогу, как в ту же секунду кажется, будто закружилась голова, а лес начал бешено вращаться вокруг. Потом все успокаивается так же внезапно, как и началось. Вы снова стоите на дороге. Никакой развилки позади нет, да и дорога совсем другая. Но делать нечего, надо идти вперед - 129.""",
         "goto":[129]},
    287:{"text":"""Вы пытаетесь зажечь свет, но чья-то невидимая рука накидывает на него черный платок, и он гаснет - 233.""",
         "goto":[233]},
    288:{"text":""" На столе действительно разложены карты Элгариола. Стрелки, прочерченные тонким пером волшебника, не оставляют никаких сомнений: вторжение должно было начаться со дня на день. Тогда по Главному Южному тракту на Элиссу хлынули бы бесчисленные полчища Орков и Гоблинов. Очевидно, волшебник вполне справедливо полагал, что угроза штурма столицы и смерти отца сломит Принцессу. Можете гордиться: планы злого чародея сорваны, к тому же в самый последний момент. Теперь можно или подойти к зеркалу (165) или осмотреть шкаф (560). Если вы уже сделали и то, и другое, то 493.""",
         "goto":[165,560,493]},
    289:{"text":"""Собрав хворост, можете разжечь небольшой костерок, подкрепиться вкуснейшей зайчатиной и восстановить 6 СИЛ. Однако с собой взять ее не в чем - все придется съесть на месте. Найти дорогу обратно уже невозможно, и вам приходится идти по тропинке, которая углубляется в лес от того места, где стояла ловушка - 406.""",
         "goto":[406]},
    290:{"text":"""Вы накладываете заклятие Огня, и огненный шар попадает в грудь первого Гоблина. Один из противников мертв, но остается еще второй. Если хотите, пользуйтесь заклятием Копии, и выясните, кто же победит.
          ГОБЛИН
          Ловкость 7 Сила 6 Лояльность 8
          Как только вам удастся уменьшить его Лояльность до 3, Гоблин обратится в бегство. Если вы убили обоих, то 620, если же только одного, можете забрать у него бронзовый свисток (- 214), который ему больше не понадобится, и перейти реку - 118.""",
         "goto":[620,118]},
    291:{"text":"""Перед вами две тропинки. Одна уходит в лес направо от входа в дом (294), другая огибает его с левой стороны, проходя через сад (334). По какой из них вы пойдете?""",
         "goto":[294,334]},
    292:{"text":"""Примерно через четверть часа пути на тропинку выходит Гиена и преграждает вам путь. Попробуйте выяснить, что ей нужно (503), или хотите сразиться с ней (264)?""",
         "goto":[503,264]},
    293:{"text":"""Перо павлина вспыхивает в ваших руках, но тут же чья-то рука накидывает на него черный платок, и оно гаснет - 233.""",
         "goto":[233]},
    294:{"text":"""Вскоре тропинка выводит вас на дорогу - 27.""",
         "goto":[27]},
    295:{"text":"""Услышав про замок, Повар сразу же теряет словоохотливость. Он или не хочет ничего сказать, или ему запрещено это делать, а в вас он вполне оправданно подозревает шпиона. Однако в конце концов его удается разговорить. Под большим секретом, десять раз взяв с вас обещание, что не проболтаетесь, и непрерывно оглядываясь, не подслушивают ли его поварята, он сообщает самую последнюю сплетню, только вчера распространившуюся по цитадели: волшебник пристрастился к игре в карты. Стараясь не подать вида, что ожидали чего-то большего, спрашиваете его, какие комнаты еще вы не видели на этом этаже и что вообще есть интересного в замке. Но Повар не понимает вашего вопроса. "Какие еще комнаты? - искренне удивляется он. - Кухня наша да кабинет мага - вот тебе и все комнаты. Отсюда - он показывает на люк - еду ему наверх подаем. Замок, конечно, небольшой, зато как все удобно и продуманно!". Вы понимаете, что волшебник позаботился о том, чтобы заколдовать своих слуг от ненужных расспросов, и, поблагодарив за беседу, выходите из кухни - 379.""",
         "goto":[379]},
    296:{"text":""" Вы достаете из заплечного мешка гребень и предлагаете его хозяйке. Она с удовольствием принимает красивую вещицу и говорит, что ей давно уже никто не делал таких подарков. Она не привыкла оставаться в долгу и предлагает в ответ свою помощь. Но вы не рискуете довериться ей и сказать, что идете сражаться с Барладом Дэртом - Зачарованный лес многому научил. Тогда хозяйка гарема спрашивает, есть ли у вас любимая девушка. И прежде чем успеваете ответить, дарит для нее хрустальный флакончик изысканных эльфийских духов (- 223). От подарков отказываться не принято: вы смущенно благодарите. После этого хозяйка гарема удаляется к себе в комнату, предоставляя вам возможность поговорить с женами мага (вернувшись на 255) или выйти из гарема в следующий коридор (251).""",
         "goto":[255,251]},
    297:{"text":"""Вы гладите Пегаса, и он отзывается на ласку радостным ржанием. К несчастному животному здесь мало кто хорошо относится, и вы завоевали его расположение. Теперь, если придется выбираться из замка, а в комнате будет открытое окно, вы можете позвать его, посмотрев параграф 609. Но учтите, Пегас может перенести вас только во Дворец Короля, ведь он не раз отвозил туда послов чародея. Поскольку управлять им вы не умеете, ни в какое другое место попасть не удастся. Погладив Пегаса, выходите из конюшни и направляетесь к зданию в центре двора - 416.""",
         "goto":[416]},
    298:{"text":""""Ты обманул меня! - в негодовании рычит Лев. - Ты не знаешь нужных слов!". И его лапа наносит удар прежде, чем вы успеваете защититься (потеряйте 2 СИЛЫ). Теперь вернитесь на 257 и попробуйте победить привратника в честном бою.""",
         "goto":[257]},
    299:{"text":"""Вы накладываете заклятие Слабости и... чувствуете, что слабеете. Коварный рыцарь обратил заклятие на вас: теперь придется во время боя вычитать 2 из своей МОЩНОСТИ УДАРА - 567.""",
         "goto":[567]},
    300:{"text":""" В какую дверь теперь попробуете выйти: в ту, что перед вами (337), или в ту, что слева (595)?""",
         "goto":[337,595]}}
    



        
    
         
         
         

         

    


#253-ловкость,#257,#255,#258,#261,#264,#290
