d = {201: {'text':"""Воспользовавшись заклятием Плавания,
            благополучно достигаете противоположного берега,
            но на этом ваши приключения не заканчиваются - 192."""  ,
      "goto": [192, 626]},
     202:{'text': """
      Проводник сразу теряет к вам интерес: он явно не ожидал такого ответа.
      "Никакого другого жилья поблизости нет, - хмуро говорит он.
      - Только леса и болота. Правда,
      - голос его переходит в шепот,
      - есть одно интересное местечко в самом центре леса.
      Черный замок. Не слыхали о таком?" Вы понимаете,
      что либо он говорит меньше, чем знает, и тогда дальнейшие расспросы бессмысленны,
      либо искренне хочет помочь и сам наводит разговор на логово волшебника.
      Попросите его все же проводить вас в Черный замок (186) или поблагодарите за обед и уйдете (291)? """ ,
       "goto" : [186,291]},
    203:{'text':"""  Темнота рассеивается. Вы направляетесь к выходу из комнаты и попадаете в каменный коридор.
Через несколько шагов в его правой стене виднеется черный провал еще одного туннеля.
Свернете (440) или пойдете прямо (140)?""",
       "goto":[440,140]},
    204:{'text':"""Вы располагаетесь на ночь под одним из деревьев,
и ничто не прерывает ваш сон. Можете восстановить 2 СИЛЫ и отправляйтесь в путь с первыми лучами солнца.
Времени терять нельзя: до цели еще не близко - 353.""",
     "goto":[353] },
    205:{'text':"""Подойдя поближе, видите,
что картина изображает не битву,а расправу.
В центре высится на коне рыцарь в латах и шлеме темно-зеленого цвета.
Рукой в железной перчатке он указывает своим воинам на горящую деревню. В другой руке у него меч.
Гоблины на заднем плане выволакивают из хат крестьян, несколько Орков с факелами поджигают дома.
Может быть, так завоевывались деревни вокруг леса?
Или это эпизод из жизни армии мага до его прихода в эти места?
Но ваши размышления прерваны: с картиной что-то происходит.
На ваших глазах Зеленый рыцарь разворачивает лошадь - теперь его перчатка направлена на вас.
Завороженный увиденным, вы окаменели и не в силах пошевелиться. Несколько Гоблинов,
вооруженных луками, поднимают их и направляют на вас.
Вы испытываете странное желание убежать от этой страшной картины,
но она притягивает, приковывает к себе.
Гоблины отпускают тетиву, стрелы летят прямо в вас, но что это?
Вы чувствуете острую боль в левой руке и под правым коленом. Стрелы!
Не теряя времени, вы отскакиваете от картины. Все немедленно принимает прежний вид.
Но стрелы-то все еще торчат! Вы осторожно вынимаете их, радуясь, что они хотя бы не отравлены.
Потеряйте 1 ЛОВКОСТЬ и 3 СИЛЫ.
Да, лучше уж либо выйти через дверь (138),
либо подняться (523) или спуститься (452) по лестницам, либо,
если вы этого еще не делали, подойти к окну (70)""",
     "goto":[138,523,452,70]},
206:{'text':""" Вы входите в комнату, и дверь бесшумно захлопывается.
Непонятно, куда же вы попали, - в комнате нет ничего и никого.
Осторожно и внимательно, ожидая какой-нибудь ловушки,
пересекаете ее и подходите к единственной двери в правой стене.
Она не открывается, несмотря на отсутствие замочной скважины.
Заперта с другой стороны на засов? Если вам есть чем открыть ее, сделайте это, иначе - 90.""",
     "goto":[90]},
    207:{'text':"""Дверь ведет в коридор, который заканчивается у очередной невысокой двери.
Она заперта, но вам без особого труда и шума удается ее выломать.
За ней узкая винтовая лестница, ведущая вниз, в подземелье замка.
Она освещена. Более того, опытный глаз сразу замечает,
что свечи в канделябрах явно недавно меняли: значит, лестницей пользуются.
Через несколько пролетов - дверь. Она заперта, и открыть ее не удается.
Вам приходится продолжать спуск - 544. """,
    "goto":[544]},
    208:{'text':"""Библиотекарь с любопытством смотрит на вас и говорит,
что не понимает, о чем идет речь. После этого он обещает все же найти кое-что интересное и скрывается за стеллажами - 649""",
    "goto":[649]},
    209:{"text":"""Купив еду (за каждую порцию рыбы ценой в 2 золотых вы можете восстановить 2 СИЛЫ),
благодарите радушного хозяина и уходите - 332.""",
    "goto":[332]},
    210:{'text':"""Вы идете по дороге, пока не смеркается.
Не чувствуя особенной опасности (зато чувствуя сильную усталость),
ночуете под сенью большого дерева справа от дороги и продолжаете путь с рассветом.
К полудню вы выходите на перекресток. Дорога на север приведет обратно в Элиссу,
а вы сворачиваете на юг - 462""",
         "goto":[462]},
    211:{'text':""" Вы оказываетесь на берегу широкой полноводной реки.
                    Течение сильное и быстрое, вброд ее не перейти.
                    Вдоль берега, на котором вы сейчас стоите, вправо убегает узкая тропинка.
                    Можете или пойти по ней, или попробовать перебраться через реку.
                    Хотите воспользоваться заклятием Левитации - 9? 
                            Заклятием Плавания - 313? 
                            Или пойдете по тропинке - 423?""",
         "goto":[9,313,423]},
     212:{'text':"""Вы выходите к огромному озеру.
                    Другого берега почти не видно, но вдалеке заметен небольшой островок.
                    Лодки поблизости нет, и придется воспользоваться заклятием либо Плавания (5),
                    либо Левитации (625). Иначе можете вернуться и попробовать пройти через кустарник (177). """,
          "goto":[5,625,177]},
     213:{'text':"""Вы остаетесь поболтать с торговцем,
                    надеясь узнать что-нибудь полезное. Благо он тараторит без умолку:
                    люди-то в лесу встречаются нечасто. Всего за час хозяин лавки успевает рассказать длинную и нудную историю о том,
                    как некогда он ехал с товарами из Элиссы в Грейкейп через пустыню, и песчаная буря заставила его пытаться найти укрытие на берегах гибельных Мортлэндских топей к югу от мощного горного хребта Лонсам.
                    Там он стал свидетелем кошмарной гибели своего товарища, когда болото поглотило тянущуюся через него дорогу вместе с находящимся на ней караваном.
                    Теперь же в Грейкейп караваны уже не ходят с тех пор, как неведомая сила стала топить выходящие в море корабли, и городок почти опустел.
                    Однако... Заметив, что вы зеваете, он спускается с небес на землю и, видимо, пытаясь продемонстрировать некоторый интерес и к вашим делам,
                    спрашивает, что вы делаете в лесу. Что ответите - ищете Черный замок (18), идете сражаться с волшебником (124),
                    идете будить Принцессу (23) или просто гуляете по лесу (438)?""",
          "goto":[18,124,23,438]},
     214:{'text':""" Не успеваете отойти от перекрестка, как внимание привлекает прекрасный вороной конь,
                     привязанный к дереву рядом с дорогой. Поблизости никого не видно, лес тих, и слышно только щебетание птиц.
                     Попробуете сесть на коня, чтобы ускорить свое продвижение вперед (дорога достаточно широка для этого) - 401,
                     или решите, что лучше оставить красивое животное хозяину и пойти дальше (378)?""",
                     "goto":[401,378]},
     215:{'text': """Обезьяна угрожающе рычит и надвигается на вас.
                     Вы выбираете бой. Если хотите воспользоваться заклятием Ловкости,
                     можете на время боя прибавить к своей Ловкости две единицы. Изберете заклятие Слабости - уменьшите на столько же МОЩНОСТЬ УДАРА Обезьяны.
                     Хотите использовать Копию, сделайте это. Ну а если предпочтете заклятие Огня, то 651.
                     Иначе - деритесь. 
                         ОБЕЗЬЯНА 
                         Ловкость 10 Сила 10 
                         Если вы победили ее, то 408.""",
                     "goto":[651,408]},
     216:{'text':""" Благополучно достигаете острова и выходите на берег - 132.""",
          "goto":[132]},
     217:{'text':"""Что вы можете ему предложить? Стрелу с белым оперением, бриллиант или золотой свисток?
                    Если у вас нет ни того, ни другого, ни третьего,
                    то, как это ни печально, придется уходить - 106.""",
                    "goto":[106]},
     218:{'text':"""
      Вы подходите к сторожке, но не успеваете заглянуть в окно,
      как на пороге появляется пьяный Гоблин. Он застывает, увидев вас,
      и хочет крикнуть, чтобы позвать остальных. ПРОВЕРЬТЕ СВОЮ УДАЧУ.
      Если удачливы, то 463, если же нет - 539.""",
          "goto":[463,539]
          },
     219:{'text': """На несколько секунд замерев, прислушиваетесь.
                    Все тихо. Можете вернуться на 467 и осмотреть что-нибудь еще.""",
          "goto":[467]},
     220:{'text':""" Невидимая рука выхватывает у вас сосуд.
                 "В этом сосуде таится смерть, - слышится голос,
                 - и ты посмел предложить его нам!" - 572.""",
                 "goto":[572]},
     221:{'text':"""Стучитесь в дверь и, услышав приглашение войти,
                    переступаете порог. Внутри чисто и опрятно,
                    навстречу спешит сухонький аккуратный старичок с длинной белой бородой.
                    Белый цвет - цвет мудрости и добра, но можно ли кому-либо доверять в этом коварном лесу?
                    Вы оглядываетесь и понимаете, что старичок несомненно жил здесь задолго до появления волшебника и был охотником.
                    Тут и там развешены шкуры, разнообразное оружие и охотничьи рога. Как следует осмотреться не удается,
                    потому что хозяин дома вступает в разговор, спрашивая, кто вы и с чем пришли.
                    Что вы скажете: идете в Черный замок служить (535), сражаться с волшебником (148),
                    освобождать Принцессу (464) или, что зашли случайно, и поторопитесь уйти (55)?""",
                    "goto":[535,148,464,55]},
     222:{'text':""" Вот и другой берег. Перебираясь через реку,
                    вы успели заметить справа, ниже по течению,
                    мост, который наверняка должен охраняться.
                    Понимая, что идти к нему не стоит, выбираете тропинку,
                    которая должна вывести на дорогу, идущую от моста.
                    Направление оказывается правильным, но путь занимает гораздо больше времени,
                    чем можно было предположить. Когда вы выходите на опушку, уже смеркается.
                    Перед вами высится Черный замок, и ужас исходит от его мрачных башен.
                    Да, видимо, главные трудности еще впереди. Как проникнуть в замок?
                    Если у вас есть волшебный пояс, вы можете воспользоваться им,
                    иначе либо идите к воротам в той стене, которая перед вами (190),
                    или, если не хотите иметь дело с охраной, попробуйте, не выходя из леса,
                    направиться влево, в обход замка (236).""",
                    "goto":[190,236]},
     223:{'text':"""Вы обходите деревню, не выпуская ее из виду.
                    Идти приходится осторожно: ведь в лесу могут встретиться охотники или дровосеки,
                    а такая встреча была бы, мягко говоря, нежелательной. Сделав четверть круга,
                    обнаруживаете выходящую из деревни дорогу. Можете отправиться по ней (2),
                    все-таки решить войти в деревню (580) или попытаться быстро пересечь дорогу и продолжать идти вокруг (29).""",
                   "goto":[2,580,29]},
     224:{'text':"""Вы откидываете крышку люка и обнаруживаете небольшой подъемник.
                    Очевидно, с его помощью с нижнего этажа в столовую доставляют подносы с едой.
                    Подъемник достаточно велик, и можно воспользоваться им, чтобы спуститься вниз.
                    Если хотите попробовать это сделать, то 491. Если же нет,
                    то вы можете уйти через одну из четырех дверей: в той же стене (427) или рядом с люком:
                    через правую (398), левую (206) или среднюю (350).
                    Хотя пока что никто не мешает продолжать осмотр столовой - 125.""",
                    "goto":[491,427,398,206,350,125]},
     225:{'text':"""На этот раз в клетке оказывается олень.
                    Вы недоумеваете, кому пришло в голову заточить благородное животное в этом мрачном подземелье.
                    Если у вас есть шкура оленя, то вы знаете, какой параграф посмотреть. Если нет, идите дальше - 465.""",
                    "goto":[465]},
     226:{'text':"""
      Вы пробуете эль.
      Вкус его неплох, но он, пожалуй, слишком крепок для вас.
      Неожиданно вы чувствуете, что шатаетесь, и пол уходит из-под ног... - 409""",
                    "goto":[409]},
     227:{'text':""" Люк заперт, и открыть его не удается.
                     Если у вас есть какие-то идеи по поводу того,
                     что могло бы послужить ключом, попробуйте отпереть замок.
                     Может быть, вам поможет медный ключик, кусок металла или фигурный ключ?
                     Если у вас нет ничего подобного, придется покинуть домик: в любую минуту сюда могут зайти воины чародея - 416.""",
                     "goto":[416]},
     228:{'text':"""Заклятие действует. Водяной чувствует, что слабеет и, понимая,
                    что ему не победить вас, хватает какой-то ларец и скрывается под водой.
                    В таверне больше нет ничего интересного, но, выйдя из нее и зайдя за дом,
                    вы обнаруживаете, что он стоит на берегу большого озера, а рядом привязана лодка.
                    Так что теперь можете либо уйти по дороге, ведущей от таверны в лес (332),
                    либо сесть в лодку и попытаться переплыть озеро (561).""",
                    "goto":[332,561]},
     229:{'text':"""За дверью - маленький встроенный шкаф,
                    на полках которого лежат меч со щитом и стоит бутылочка с прозрачной жидкостью.
                    Возьмете меч (568), щит (498) или выпьете жидкость из бутылочки (389)?
                    Разумеется, можете ничего не брать, а просто закрыть дверь и снова запереть ее - 300.""",
                    "goto":[568,498,389,300]},
     230:{'text':""" Вы продвигаетесь медленно и осторожно.
                     Тьма кромешная: о существовании противоположной стены можно только догадываться.
                     Через некоторое время рука нащупывает угол.
                     Пойдете направо (549) или попробуете пройти в темноте прямо, ни за что не держась (466)?""",
                     "goto":[549,466]},
     231:{'text':"""Тропинка, идущая прямо, несколько раз заводит в такой бурелом,
                    через который вы едва продираетесь,
                    а несколько раз даже спотыкаетесь и падаете (потеряйте 1 СИЛУ).
                    По пути вы видели несколько силков: это наводит на размышления - 406.""",
          "goto":[406]},
     232:{'text':"""Лесная дорожка вскоре подходит совсем вплотную к стене Черного замка и упирается в нее.
                    Приблизившись, замечаете в стене небольшую дверцу.
                    Если знаете, как открыть ее, то сделайте это.
                    Иначе придется идти к воротам: впереди излучена реки,
                    проникающей под стену замка, но берег в этом месте особенно неприступен - 319.""",
                    "goto":[319]},
     233:{'text':""""Наивный смельчак, - смеются Духи, - хотел разозлить нас тем,
                     что мы ненавидим больше всего - светом. Ты пожалеешь об этом" - 572.""",
                     "goto":[572]},
     234:{'text':"""Оставив умирающего, продолжаете путь.
                    Не успели войти в лес, как сразу же начались приключения - что же будет дальше?
                    Лес безлюден, но птиц много. Их веселое пение говорит о том,
                    что страшные слуги волшебника еще далеко. Но вот снова развилка: дорога,
                    чуть-чуть сворачивая направо, углубляется в лес, а влево от нее отходит тропинка. Куда вы пойдете? 
                                    По тропинке? - 47. 
                                    По дороге? - 82.""",
                    "goto":[47,82]},
     235:{'text':"""Вы быстро удаляетесь от деревни, считая, что выбрали правильное направление,
                    и должны идти как раз в сторону Черного замка.
                    Кажется, это похоже на правду: лес понемногу начинает редеть,
                    и впереди становится виден свет. Но это не яркий солнечный свет:
                    солнце не может пробиться сквозь плотные облака,
                    висящие над лесом. Птиц давно уже не слышно, что все больше и больше давит,
                    - тишина таит в себе угрозу. Вы начинаете нервничать (потеряйте 1 СИЛУ).
                    В конце концов лес позади, но за поворотом дороги... - 102.""",
                    "goto":[102]},
     236:{'text':"""Замок оказывается гораздо больше,
                    чем казалось поначалу. Стараясь не слишком приближаться к нему,
                    доходите до южной стены, без единой бойницы и без единого просвета.
                    Кажется, что волшебник совершенно не боится штурма:
                    только башенки по краям внимательно смотрят в сторону леса. 
                     Пойдете дальше? - 533. 
                     Или попробуете перелететь через стену, используя заклятие Левитации? - 87.""",
                     "goto":[533,87]},
     237:{'text':"""Тропинка приводит в светлую березовую рощу и начинает все больше и больше забирать вправо.
                     Вдруг вы видите, что в траве рядом с тропинкой что-то блестит. Подойдете посмотреть,
                     что это такое (108) или пойдете дальше (407)? ""","goto":[108,407]},
     238:{'text': """Вы достигаете противоположного берега и,
                    как ни странно, попадаете прямо на тропинку.
                    Удивляться причудам Зачарованного леса некогда: надо постараться засветло достичь цитадели мага.
                    Если вы еще ориентируетесь в лесу, то сообразите, направо или налево надо идти, так как впереди развилка.
                    И в ту, и в другую сторону идут две одинаковые тропинки, но выбор делать придется. Пойдете направо (390)
                    или налево (531)?""",
                    "goto":[390,531]},
     239:{'text': """Справившись с обоими противниками,
                    можете осмотреть дом, в котором оказались.
                    В нем нет ничего интересного, кроме картины,
                    висящей на стене напротив входа.
                    На ней рыцарь в зеленых латах и зеленом шлеме во весь опор скачет по лесной дороге.
                    Картина любопытна, но ни о чем не напоминает: при дворе таких рыцарей не встречалось.
                    Может быть, это воинство волшебника?
                    Пока же ясно только одно: если этот рыцарь враг, то такая встреча не сулит ничего хорошего.
                    Бутылка, которую нес Гоблин, разбилась, но в погребе удается найти еще одну и немного еды.
                    Можете использовать и то, и другое или же взять с собой: вино восстановит вам 3 СИЛЫ, еда - 2.
                    В кармане у Орка лежит серебряный свисток (+ 313), который можете взять себе.
                    Теперь пора уходить. От Заставы в глубь леса ведет удобная широкая дорога,
                    и вы быстро идете по ней, стараясь наверстать упущенное время.
                    Вскоре направо от нее отходит узенькая тропка. Хотите свернуть (531) или пойдете дальше (64)?""",
                    "goto":[531,64]},
     240:{'text':"""Вот и первый перекресток. Пойдете прямо (462) или налево (145)?""",
                    "goto":[462,145]},
     241:{'text':"""Вы открываете дверь.
                    Перед вами небольшая зала, в которой жарко и душно от множества горящих свечей,
                    стоящих вдоль стен в тяжелых бронзовых канделябрах на двенадцати золотых столиках.
                    Кроме "вашей", из нее ведут еще три двери.
                    На небольшом возвышении в центре - хрустальная кровать, на которой спит прекрасная девушка.
                    Ее длинные распущенные волосы отсвечивают золотом. Вы сразу понимаете,
                    что это Принцесса, и сами удивляетесь тому, что узнали ее, хотя лишь раз мельком видели портрет,
                    когда Король напутствовал вас в дорогу. В углу комнаты - большое зеркало,
                    можете приветливо кивнуть своему отражению - 485.""",
                    "goto":[485]},
     242:{'text':"""Вам нечем это доказать, и разбойники не верят ни единому слову.
                 "Какие только байки не рассказывают те,
                кто попадает к нам в руки!" - смеются они.
                Так что вам лучше не терять времени и начинать неизбежный бой - 123.""",
      "goto":[123]},
     243:{'text':"""
      Вы входите в комнату.
      Но стоит только переступить порог, как одежда на вешалке начинает шевелиться,
      и через несколько секунд перед вами появляется кошмарный Призрак.
      Он похож на живого мертвеца: остекленевшие глаза, бессмысленное лицо,
      рот, из которого вывалились все зубы и свисает синий распухший язык.
      Призрак безоружен, но его правая рука рассекает воздух, как меч.
      Придется драться с ним. Заклятия не помогут - исчадие Тьмы без труда с ними справится. 
      ПРИЗРАК 
      Ловкость 10 Сила 8 
      Если вы победили Призрака, он исчезнет, а вы можете либо уйти от греха подальше (вернувшись на параграф с описанием большой залы
      (39) и выбрав что-нибудь более приятное), либо осмотреть сундуки у противоположной стены.
      В этом случае решите, с какого начнете: с большого (474),
      среднего (540) или маленького (380)?""",
          "goto":[39,380,474,540]},
     244:{'text':"""Вспомнив о серебряном сосуде, вы достаете его из заплечного мешка и по лицам рыцарей видите,
             что это то, что надо. Даже Капитан привстает из своего кресла,
             но не успевает ничего сказать - на его лице отражается ужас. Вы быстро срываете крышку,
             и зеленоватый газ наполняет помещение. Однако вы и сами напуганы не меньше стражников, так как не знаете,
             что именно выпустили на свободу. Впрочем, этого вы не узнаете никогда. Придется удовлетвориться тем,
             что газ задушил всех рыцарей, не причинив вам никакого вреда. Но удивляться времени нет,
             и вы быстро взбегаете по лестнице на небольшой балкончик. С него ведут две двери.
             Войдете в правую (594) или в левую (599)?""",
             "goto":[594,599]},
     245:{'text':"""Если у вас есть шкура лисы,
            то покажите ее как образец товара и проходите,
            если же нет, то что бы вы не доставали из заплечного мешка,
            стражу это не заинтересует, и вам придется прокладывать путь в замок своим мечом - 341. """,
           "goto":[341]},
     246:{'text':"""Слава Богу, есть чем открыть дверь,
             и вы быстро делаете это, спасаясь от неминуемой смерти - 350. """,
            "goto":[350]},
     247:{'text':"""ДУХ МЕРТВЫХ 
                    Ловкость 10 Сила 12 
                    Во время битвы можете попытаться убежать (83).
                    Но если удалось победить, то 381. """,
                   "goto":[83,381]},
     248:{'text':"""Драться с охраной в замке было не самым разумным решением.
                    Лязг и грохот далеко разносятся по гулким коридорам, и Оркам приходит подмога.
                   Отряд Гоблинов врывается в комнату, и вы не в силах противостоять такому числу врагов.
                   Боевой топор глубоко входит в ваше тело, а труп еще долго рвут на куски озверевшие воины чародея... """,
          "goto":[]},
     249:{'text':"""Но что вы можете ему сказать?
                    Что вас пригласили в замок и вы просто ошиблись дверью (562),
                    или что вам поручили что-то передать ему (315)? """,
          "goto":[315,562]},
     250:{'text':"""Вы решаете довериться дороге и пойти прямо.
                  Она не обманывает ваших ожиданий и приводит к крепкому бревенчатому дому,
                  заканчиваясь у его дверей - 33. """,
          "goto":[33]},    
}


